{
    "status": "ok",
    "totalResults": 228573,
    "articles": [
        {
            "source": {
                "id": null,
                "name": "Slashdot.org"
            },
            "author": "feedfeeder",
            "title": "Defense Secretary Lloyd Austin was hospitalized for elective surgery complications - NPR",
            "description": "Defense Secretary Lloyd Austin was hospitalized for elective surgery complicationsNPR GOP senators outraged over 'shocking breakdown' related to Defense Sec Lloyd Austin's secret hospitalizationFox News Biden wasn’t aware for days that Defense Secretary Austi…",
            "url": "https://slashdot.org/firehose.pl?op=view&amp;id=172690562",
            "urlToImage": null,
            "publishedAt": "2024-01-07T12:33:16Z",
            "content": "Sign up for the Slashdot newsletter! OR check out the new Slashdot job board to browse remote jobs or jobs in your areaDo you develop on GitHub? You can keep using GitHub but automatically sync your … [+268 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Minneapolis Star Tribune"
            },
            "author": "NOAH TRISTER",
            "title": "Steelers top Lamar-less Ravens 17-10, await playoff fate",
            "description": "The Steelers would make the playoffs Sunday if Buffalo loses to Miami, or Jacksonville loses to Tennessee. But they might have lost T.J. Watt to a knee injury.",
            "url": "https://www.startribune.com/steelers-top-lamar-less-ravens-17-10-await-playoff-fate/600332995/",
            "urlToImage": "https://chorus.stimg.co/25209130/merlin_73215223.jpg?h=630&w=1200&fit=crop&bg=999&crop=faces",
            "publishedAt": "2024-01-07T12:32:11Z",
            "content": "BALTIMORE (AP) Cameron Heyward figures the Pittsburgh Steelers can make some noise in the playoffs.\r\nThey still need a little help to get in, but they've certainly done their part down the stretch.\r\n… [+4017 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Dublin Live"
            },
            "author": "Sylvia Pownall",
            "title": "Judge Gerard O'Brien resigns following sexual assault conviction",
            "description": "A spokesman for the Department of Justice said the Minister had accepted O’Brien’s resignation with immediate effect",
            "url": "https://www.dublinlive.ie/news/judge-gerard-obrien-resigns-following-28404041",
            "urlToImage": "https://i2-prod.dublinlive.ie/incoming/article28404042.ece/ALTERNATES/s1200/0_I240106_131000_28607214oTextTRMRMMGLPICT000320149887o.jpg",
            "publishedAt": "2024-01-07T12:32:08Z",
            "content": "A judge who sexually assaulted six young men has quit the bench.\r\nJustice Minister Helen McEntee last night confirmed Gerard OBriens resignation as a Circuit Court judge.\r\nOBrien, 59, was found guilt… [+2687 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Marketscreener.com"
            },
            "author": null,
            "title": "Five people trapped in Slovenia cave after heavy rainfall",
            "description": "(marketscreener.com) Five people have been trapped in a cave in southwestern Slovenia since Saturday afternoon after heavy rainfall raised the water levels, making it impossible for rescuers to take them out safely, local media reported on Sunday.https://www.…",
            "url": "https://www.marketscreener.com/news/latest/Five-people-trapped-in-Slovenia-cave-after-heavy-rainfall-45688113/",
            "urlToImage": "https://www.marketscreener.com/images/twitter_MS_fdnoir.png",
            "publishedAt": "2024-01-07T12:31:35Z",
            "content": "SARAJEVO (Reuters) - Five people have been trapped in a cave in southwestern Slovenia since Saturday afternoon after heavy rainfall raised the water levels, making it impossible for rescuers to take … [+980 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Kemifilani.ng"
            },
            "author": "Ifunanya Nwa",
            "title": "Regina Daniels reveals her hilarious response after her husband inquired her if she would have married him if he was a mechanic",
            "description": "Regina Daniels, the popular actress, recently shared a light-hearted moment with her billionaire husband, Ned Nwoko, on Instagram. In a playful exchange, Ned asked Regina if she would have still married him if he were a mechanic instead of a wealthy man. Regi…",
            "url": "https://www.kemifilani.ng/entertainment/regina-daniels-married-mechanic/",
            "urlToImage": "https://www.kemifilani.ng/wp-content/uploads/2024/01/E7114DF3-0071-42C3-A0BA-1142AA09E5B9.jpeg",
            "publishedAt": "2024-01-07T12:31:31Z",
            "content": "Regina Daniels, the popular actress, recently shared a light-hearted moment with her billionaire husband, Ned Nwoko, on Instagram. In a playful exchange, Ned asked Regina if she would have still marr… [+1008 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "FRANCE 24 English"
            },
            "author": "FRANCE24",
            "title": "Health ministry in Hamas-run Gaza says 2 journalists killed in Israeli strike",
            "description": "Mustafa Thuria, a video stringer for AFP news agency, and Hamza Wael Dahdouh, a journalist with the Al Jazeera television network, were killed while they were travelling in a car, the ministry and medics said.\n\nAFP has asked the Israeli army for comment. The …",
            "url": "https://www.france24.com/en/live-news/20240107-health-ministry-in-hamas-run-gaza-says-2-journalists-killed-in-israeli-strike",
            "urlToImage": "https://s.france24.com/media/display/a8303b28-ad58-11ee-ad66-005056a97e36/w:1280/p:16x9/b47d2d15fbe08c70b84a6341f270f91614a39db5.jpg",
            "publishedAt": "2024-01-07T12:31:19Z",
            "content": "Gaza Strip (Palestinian Territories) (AFP) The health ministry in the Hamas-run Gaza Strip said on Sunday that an Israeli air strike killed two journalists in the Palestinian territory. Mustafa Thuri… [+1903 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Upenn.edu"
            },
            "author": "Victor Mair",
            "title": "Language that exercises the brain; poetry and gradations of understanding",
            "description": "If you want to give your brain fortifying nutrition, what kind of language should you feed it? \"Complex, unfamiliar sentences make the brain’s language network work harder\" A new study finds that language regions in the left hemisphere light up when reading u…",
            "url": "https://languagelog.ldc.upenn.edu/nll/?p=62065",
            "urlToImage": null,
            "publishedAt": "2024-01-07T12:30:22Z",
            "content": "« previous post | \r\nIf you want to give your brain fortifying nutrition, what kind of language should you feed it?\r\n\"Complex, unfamiliar sentences make the brains language network work harder\"\r\nA new… [+4830 chars]"
        },
        {
            "source": {
                "id": "usa-today",
                "name": "USA Today"
            },
            "author": "Aggies Wire",
            "title": "Watch: Texas A&M transfer commit Derrick Graham shows off his athleticism",
            "description": "Former Troy OL Derrick Gramham moonlights as a tight end near the goaline",
            "url": "https://aggieswire.usatoday.com/2024/01/07/watch-texas-am-transfer-commit-derrick-graham-shows-off-his-athleticism/",
            "urlToImage": "https://s.yimg.com/ny/api/res/1.2/uGRRcldBKWAhrwD7PY_Vfw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/aggies_wire_usa_today_articles_632/6182e1ccdbced0348a7cac59702f4a9a",
            "publishedAt": "2024-01-07T12:30:19Z",
            "content": "Weve seen a lot of Offensive linemen score touchdowns over the years throughout college football and the NFL. We even saw one last week when the Detroit Lions believed they scored against the Dallas … [+867 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Wealthofgeeks.com"
            },
            "author": "Marianne Paluso",
            "title": "The 25 Best Tom Hanks Performances",
            "description": "Tom Hanks is one of Hollywood's most beloved and well-respected actors. Often called a modern-day James Stewart, it is easy to understand why because Hanks is often thought of as the “every man.” And while that is a fair assessment, the career of Hanks is als…",
            "url": "https://wealthofgeeks.com/the-25-best-tom-hanks-performances-2/",
            "urlToImage": "https://wealthofgeeks.com/wp-content/uploads/2023/12/Tom-Hanks-Forest-Gump.jpg",
            "publishedAt": "2024-01-07T12:30:07Z",
            "content": "Tom Hanks is one of Hollywood's most beloved and well-respected actors. Often called a modern-day James Stewart, it is easy to understand why because Hanks is often thought of as the “every man.” And… [+31722 chars]"
        },
        {
            "source": {
                "id": "newsweek",
                "name": "Newsweek"
            },
            "author": "Alice Gibbs",
            "title": "Photo of 'Dangerous Radiation' Reading Onboard Passenger Plane Goes Viral",
            "description": "The radiation reading on a regular airplane flight sparked conversation online.",
            "url": "https://www.newsweek.com/photo-dangerous-radiation-reading-onboard-passenger-plane-viral-1857791",
            "urlToImage": "https://d.newsweek.com/en/full/2331333/geiger-counter.png",
            "publishedAt": "2024-01-07T12:30:01Z",
            "content": "German traveler Carsten Möhrke recently unearthed a photograph taken during a flight he took in August 2012, revealing an unsettling radiation reading on his Geiger counter.\r\nTraveling from his home … [+4610 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Just Arsenal News"
            },
            "author": "Admin Pat",
            "title": "Which Liverpool players Arsenal must watch out for this afternoon",
            "description": "Liverpool’s danger men As we welcome Klopp and Liverpool to The Emirates for the first time in 2024, we’re set to see an action-packed game, and as everyone knows, in an FA Cup game, anything can happen. Arsenal is coming off a challenging period in their sea…",
            "url": "https://www.justarsenal.com/which-liverpool-players-arsenal-must-watch-out-for-this-afternoon/357361",
            "urlToImage": "https://icdn.justarsenal.com/wp-content/uploads/2021/11/jota1.jpg",
            "publishedAt": "2024-01-07T12:30:00Z",
            "content": "Liverpools danger men\r\nAs we welcome Klopp and Liverpool to The Emirates for the first time in 2024, were set to see an action-packed game, and as everyone knows, in an FA Cup game, anything can happ… [+2692 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Marketscreener.com"
            },
            "author": null,
            "title": "Sister of Israeli hostages marks the way home with shoes",
            "description": "(marketscreener.com) STORY: Osnat Sharabi Matalon estimated she had received around five thousand pairs, donated by friends as well as complete strangers.https://www.marketscreener.com/news/latest/Sister-of-Israeli-hostages-marks-the-way-home-with-shoes--4568…",
            "url": "https://www.marketscreener.com/news/latest/Sister-of-Israeli-hostages-marks-the-way-home-with-shoes-45688169/",
            "urlToImage": "https://www.marketscreener.com/images/twitter_MS_fdblanc.png",
            "publishedAt": "2024-01-07T12:29:37Z",
            "content": "STORY: Osnat Sharabi Matalon estimated she had received around five thousand pairs, donated by friends as well as complete strangers.\r\n \"I want people to step in my shoes and walk this path that we a… [+354 chars]"
        },
        {
            "source": {
                "id": "the-times-of-india",
                "name": "The Times of India"
            },
            "author": "AFP",
            "title": "Two journalists killed in Israeli strike on Sunday",
            "description": "Israeli air strike kills two journalists, Mustafa Thuria and Hamza Wael Dahdouh, in the car. Mustafa is a video stringer for AFP news agency and Hamza is a journalist with Al Jazeera. Hamza's father, Wael al-Dahdouh, is the Gaza bureau chief for Al Jazeera an…",
            "url": "https://timesofindia.indiatimes.com/world/middle-east/two-journalists-killed-in-israeli-strike-on-sunday/articleshow/106614385.cms",
            "urlToImage": "https://static.toiimg.com/thumb/msid-106614424,width-1070,height-580,imgsize-1648685,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
            "publishedAt": "2024-01-07T12:27:47Z",
            "content": "Superfood Moringa Soup which can fix a number of deficiencies"
        },
        {
            "source": {
                "id": "al-jazeera-english",
                "name": "Al Jazeera English"
            },
            "author": "Al Jazeera",
            "title": "Bangladesh counts votes in low-turnout election boycotted by opposition",
            "description": "Initial signs suggest a low turnout in controversial poll guaranteed to give a fourth straight term to PM Sheikh Hasina.",
            "url": "https://www.aljazeera.com/news/2024/1/7/bangladesh-counts-votes-in-low-turnout-election-boycotted-by-opposition",
            "urlToImage": "https://www.aljazeera.com/wp-content/uploads/2024/01/AP24007114343879-1704598735.jpg?resize=1920%2C1440",
            "publishedAt": "2024-01-07T12:27:42Z",
            "content": "Bangladesh election officials are counting votes after a controversial poll, fraught with violence and boycotted by the opposition, is guaranteed to give a fourth straight term to Prime Minister Shei… [+5285 chars]"
        },
        {
            "source": {
                "id": "cbc-news",
                "name": "CBC News"
            },
            "author": null,
            "title": "Nadal withdraws from the Australian Open just 1 tournament into his comeback",
            "description": "Rafael Nadal withdrew from the Australian Open with an injury a week before the season's first major was due to start after playing just one tournament in his comeback from 12 months on the sidelines.",
            "url": "https://www.cbc.ca/sports/tennis/nadal-hip-australian-open-withdrawal-1.7076761",
            "urlToImage": "https://i.cbc.ca/1.7075978.1704488266!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/australia-brisbane-tennis.jpg",
            "publishedAt": "2024-01-07T12:27:07Z",
            "content": "Rafael Nadal withdrew from the Australian Open with an injury a week before the season's first major was due to start after playing just one tournament in his comeback from 12 months on the sidelines… [+2026 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Biztoc.com"
            },
            "author": "benzinga.com",
            "title": "Biden Vs Trump, Kim Jong Un Artillery Fire, Marjorie Taylor Greene Racts To Stock Trading Data And More: This Week In Politics",
            "description": "This weekend brought a flurry of news, from political chess moves in the upcoming presidential race to unexpected military actions. In the domestic political arena, celebrities and former White House lawyers weighed in on the ongoing Biden-Trump saga. Meanwhi…",
            "url": "https://biztoc.com/x/ae80495557e9e48c",
            "urlToImage": "https://c.biztoc.com/p/ae80495557e9e48c/s.webp",
            "publishedAt": "2024-01-07T12:26:10Z",
            "content": "This weekend brought a flurry of news, from political chess moves in the upcoming presidential race to unexpected military actions. In the domestic political arena, celebrities and former White House… [+284 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Antaranews.com"
            },
            "author": "Aji C, Kenzu",
            "title": "Media, influencers strategic partners in developing Nusantara: OIKN",
            "description": "The Nusantara City Capital Authority (IKN) said that mass media and influencers are strategic partners in building the Nusantara City in East Kalimantan.\r\n\"Media and influencers are our strategic partners in building ...",
            "url": "https://en.antaranews.com/news/302589/media-influencers-strategic-partners-in-developing-nusantara-oikn",
            "urlToImage": "https://cdn.antaranews.com/cache/1200x800/2024/01/07/ikn-1-4-1.jpg",
            "publishedAt": "2024-01-07T12:25:13Z",
            "content": "Jakarta (ANTARA) - The Nusantara City Capital Authority (IKN) said that mass media and influencers are strategic partners in building the Nusantara City in East Kalimantan.\"Media and influencers are … [+1831 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Livemint"
            },
            "author": "Livemint",
            "title": "Infosys cofounder Narayana Murthy once slept on box in storeroom, reveals book | Details here",
            "description": "A biography on Narayana Murthy and Sudha Murty reveals that a US client made Murthy sleep on a large box in a windowless storeroom during a visit to the United States, despite the client's own home having four bedrooms.",
            "url": "https://www.livemint.com/companies/people/infosys-cofounder-narayana-murthy-once-slept-on-box-in-storeroom-reveals-book-details-here-11704626624299.html",
            "urlToImage": "https://www.livemint.com/lm-img/img/2024/01/07/1600x900/Narayana_Murthy-Sudha_Murty_1673313317735_1704629467454.jpg",
            "publishedAt": "2024-01-07T12:22:59Z",
            "content": "A US client made Infosys co-founder Narayana Murthy sleep on a large box in a windowless storeroom surrounded by cartons during a visit to the United States for work in the initial days. However, the… [+3260 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "NDTV News"
            },
            "author": null,
            "title": "\"Best Uber Ever\": Cab Driver Uses Karaoke Singing To Entertain Passengers",
            "description": "The video was posted on Instagram by the Uber driver herself. Her page is filled with videos of her jamming with her passengers.",
            "url": "https://www.ndtv.com/offbeat/best-uber-ever-cab-driver-uses-karaoke-singing-to-entertain-passengers-4817230",
            "urlToImage": "https://c.ndtvimg.com/2024-01/67vg5jfg_uber-driver-karaoke_625x300_07_January_24.jpeg?ver-20231203.06",
            "publishedAt": "2024-01-07T12:22:12Z",
            "content": "The video concludes with everyone joining in for a collective singing session.\r\nA taxi driver gained widespread attention on social media due to a unique arrangement for passengers in her vehicle. Ta… [+1417 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Marketscreener.com"
            },
            "author": null,
            "title": "Japan's Hokuriku Elec reports minor oil leak from Shika nuclear plant",
            "description": "(marketscreener.com) Japan's Hokuriku Electric Power\non Sunday reported a small oil leak from its Shika\nnuclear power station, which was shaken by a powerful earthquake\non New Year's Day.\n External radiation levels were not affected and there were\nno adverse …",
            "url": "https://www.marketscreener.com/quote/stock/HOKURIKU-ELECTRIC-POWER-C-6492056/news/Japan-s-Hokuriku-Elec-reports-minor-oil-leak-from-Shika-nuclear-plant-45688110/",
            "urlToImage": "https://www.marketscreener.com/images/reuters/2024-01/2024-01-07T123023Z_1_LYNXMPEK0605H_RTROPTP_3_JAPAN-QUAKE-NUCLEAR-HOKURIKU-ELEC-PW.JPG",
            "publishedAt": "2024-01-07T12:20:42Z",
            "content": "TOKYO, Jan 7 (Reuters) - Japan's Hokuriku Electric Power\r\non Sunday reported a small oil leak from its Shika\r\nnuclear power station, which was shaken by a powerful earthquake\r\non New Year's Day.\r\nExt… [+1569 chars]"
        },
        {
            "source": {
                "id": "breitbart-news",
                "name": "Breitbart News"
            },
            "author": "Simon Kent, Simon Kent",
            "title": "Electric Vehicle Sales Slump to Just a Quarter of New Purchases",
            "description": "Sales of electric vehicles (EVs) are defying the urging of green lobbyists and government diktat with just a quarter making up new purchases for 2023, data reveals.",
            "url": "https://www.breitbart.com/europe/2024/01/07/electric-vehicle-sales-slump-to-just-a-quarter-of-new-purchases/",
            "urlToImage": "https://media.breitbart.com/media/2022/10/AP22203762599127-1-640x335.jpg",
            "publishedAt": "2024-01-07T12:20:23Z",
            "content": "Sales of electric vehicles (EVs) are defying the combined urging of green lobbyists and government diktat with just a quarter making up new purchases for 2023, UK data reveals.\r\nThe consumer rejectio… [+1591 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Tv9kannada.com"
            },
            "author": "Vijaya Sarathy Sn",
            "title": "Boycott maldives trending indians cancel more than 8000 hotel bookings 2500 flight tickets snvs Kannada News",
            "description": "Boycott Maldives Trending: ಲಕ್ಷದ್ವೀಪದಲ್ಲಿ ಪ್ರಧಾನಿ ಮೋದಿ ಮಾಡಿದ ಫೋಟೋಶೂಟ್ ಬಗ್ಗೆ ಮಾಲ್ಡೀವ್ಸ್​ನ ಸಚಿವರು ಲೇವಡಿ ಮಾಡಿದ ಬಳಿಕ ಭಾರತೀಯರಿಂದ ಬಾಯ್ಕಾಟ್ ಟ್ರೆಂಡ್ ನಡೆದಿದೆ. ಮಾಲ್ಡೀವ್ಸ್​ಗೆ ಭಾರತೀಯರು 8,000 ಹೋಟೆಲ್ ಬುಕಿಂಗ್ಸ್ ಮತ್ತು 2,500 ಫ್ಲೈಟ್ ಟಿಕೆಟ್ ಬುಕಿಂಗ್​ಗಳನ್ನು ರದ್ದು ಮಾಡಿದ್ದಾರೆ. ಪ್ರವ…",
            "url": "https://tv9kannada.com/business/boycott-maldives-trending-indians-cancel-more-than-8000-hotel-bookings-2500-flight-tickets-snvs-756344.html",
            "urlToImage": "https://images.tv9kannada.com/wp-content/uploads/2024/01/maldives-tourism-1.jpg",
            "publishedAt": "2024-01-07T12:20:11Z",
            "content": ", 7: (Narendra Modi visit to Lakshadweep) (Mariyam Shiuna) . 8,000 2,500 . . .\r\n , . . , .\r\n : Boycott Maldives: , ?\r\n . . .\r\n . () .\r\n:  , \r\n . . ? ? , .\r\n. 2023 883.4 . 170 . . . 17. . 40 . . 70 .\r… [+20 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Biztoc.com"
            },
            "author": "finance.yahoo.com",
            "title": "Bitcoin ETFs Could Launch This Week. Here's How Much You'll Pay in Fees and Why It Might Be Worth It",
            "description": "Thirteen spot Bitcoin (CRYPTO: BTC) ETFs are currently awaiting approval from the Securities and Exchange Commission (SEC). Up to this point, the SEC has denied similar exchange-traded fund (ETF) applications, but an appellate court ruled the SEC's rejection …",
            "url": "https://biztoc.com/x/f046be56b93fef1f",
            "urlToImage": "https://c.biztoc.com/p/f046be56b93fef1f/s.webp",
            "publishedAt": "2024-01-07T12:20:08Z",
            "content": "Thirteen spot Bitcoin (CRYPTO: BTC) ETFs are currently awaiting approval from the Securities and Exchange Commission (SEC).Up to this point, the SEC has denied similar exchange-traded fund (ETF) appl… [+298 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "InvestorsObserver"
            },
            "author": "InvestorsObserver",
            "title": "Acer Collaborates with Qualcomm to Launch Two New Routers, Including the World's First 5G Wi-Fi 7 Gaming CPE",
            "description": "Acer Collaborates with Qualcomm to Launch Two New Routers, Including the World's First 5G Wi-Fi 7 Gaming CPE           PR Newswire         Experience lightning-fast speeds and low network latency with the new Predator Connect T7 Wi-Fi 7 Mesh Router for...",
            "url": "https://www.investorsobserver.com/news/qm-pr/7333172944559383",
            "urlToImage": "https://s3.amazonaws.com/images.investorsobserver.com/io-logo-800x450.jpg",
            "publishedAt": "2024-01-07T12:20:00Z",
            "content": "Experience lightning-fast speeds and low network latency with the new Predator Connect T7 Wi-Fi 7 Mesh Router for wireless gaming\r\nEditor's Summary:\r\n<ul><li>\r\n The Predator Connect X7 5G CPE, incorp… [+6491 chars]"
        },
        {
            "source": {
                "id": "the-irish-times",
                "name": "The Irish Times"
            },
            "author": null,
            "title": "Rafael Nadal to miss Australian Open after new muscle tear",
            "description": "Spaniard made long-awaited comeback in Brisbane after a year on the sidelines with injury",
            "url": "https://www.irishtimes.com/sport/tennis/2024/01/07/rafael-nadal-to-miss-australian-open-after-new-muscle-tear/",
            "urlToImage": "https://www.irishtimes.com/resizer/39QNxHTYoz6Sbkxt4jsoDlqBFQo=/1200x630/filters:format(jpg):quality(70):focal(3230x1021:3240x1031)/cloudfront-eu-central-1.images.arcpublishing.com/irishtimes/KQHGWE74FLZVAIRUFZ7QWWXDI4.jpg",
            "publishedAt": "2024-01-07T12:19:46Z",
            "content": "Rafael Nadal has announced that he is withdrawing from the Australian Open after an MRI scan revealed that he had a micro tear on a muscle at the Brisbane International.\r\nThe tennis great made his lo… [+2170 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "DW (English)"
            },
            "author": "Deutsche Welle",
            "title": "Japan: Woman in 90s rescued as snow hinders quake relief",
            "description": "The death toll from the earthquake which struck Japan on New Year's Day has risen to 128 as inclement weather hinders rescue efforts. However, there was good news when an elderly lady was pulled alive from the rubble. A woman in her 90s was rescued against al…",
            "url": "https://www.dw.com/en/japan-woman-in-90s-rescued-as-snow-hinders-quake-relief/a-67909524",
            "urlToImage": "https://static.dw.com/image/67908215_6.jpg",
            "publishedAt": "2024-01-07T12:17:00Z",
            "content": "A woman in her 90s was rescued against all odds on Saturday after being trapped under rubble for a little over five days following the powerful earthquake which shook central Japan on New Year's Day.… [+3076 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Marketscreener.com"
            },
            "author": null,
            "title": "Czech central bank vice-governor Zamrazilova: larger than 25 bps rate cuts possible if inflation falls faster",
            "description": "(marketscreener.com) The pace of Czech central bank's lowering of interest rates will depend on the pace of decline in inflation, the bank's Vice-Governor Eva Zamrazilova said on CNN Prima News television on Sunday.https://www.marketscreener.com/news/latest/C…",
            "url": "https://www.marketscreener.com/news/latest/Czech-central-bank-vice-governor-Zamrazilova-larger-than-25-bps-rate-cuts-possible-if-inflation-fal-45688109/",
            "urlToImage": "https://www.marketscreener.com/images/twitter_MS_fdnoir.png",
            "publishedAt": "2024-01-07T12:16:39Z",
            "content": "PRAGUE (Reuters) - The pace of Czech central bank's lowering of interest rates will depend on the pace of decline in inflation, the bank's Vice-Governor Eva Zamrazilova said on CNN Prima News televis… [+427 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Antaranews.com"
            },
            "author": "Fransiska N, Kenzu",
            "title": "Joint SAR team patrols areas affected by Lewotobi Laki-Laki's eruption",
            "description": "The joint Search and Rescue (SAR) team has patrolled several villages affected by the eruption of Mount Lewotobi Laki-Laki in East Flores, East Nusa Tenggara (NTT).\r\n\"The target is to visit the evacuation tents around the ...",
            "url": "https://en.antaranews.com/news/302586/joint-sar-team-patrols-areas-affected-by-lewotobi-laki-lakis-eruption",
            "urlToImage": "https://cdn.antaranews.com/cache/1200x800/2024/01/07/2024_0107_16280000.jpg",
            "publishedAt": "2024-01-07T12:16:17Z",
            "content": "Wulanggitang, E Nusa Tenggara (ANTARA) - The joint Search and Rescue (SAR) team has patrolled several villages affected by the eruption of Mount Lewotobi Laki-Laki in East Flores, East Nusa Tenggara … [+1705 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Kvraudio.com"
            },
            "author": "KVR",
            "title": "Bela D Media Voices for Kontakt 50% Off",
            "description": "KVR Audio News: Bela D Media is offering a 50% savings on all full versions of Voices for Kontakt, Professional Vocalists and Choirs. Use the promo code BDM50 at www.beladmedia.com. Available discounts are not shown ...",
            "url": "https://www.kvraudio.com/news/bela-d-media-voices-for-kontakt-50-off-59760",
            "urlToImage": "https://static.kvraudio.com/i/b/bdb_shot5.png",
            "publishedAt": "2024-01-07T12:15:46Z",
            "content": "Bela D Media is offering a 50% savings on all full versions of Voices for Kontakt, Professional Vocalists and Choirs.\r\nUse the promo code BDM50 at www.beladmedia.com.\r\nAvailable discounts are not sho… [+93 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "InvestorsObserver"
            },
            "author": "InvestorsObserver",
            "title": "Acer Debuts Curved OLED and MiniLED Monitors for Avid Gamers",
            "description": "Acer Debuts Curved OLED and MiniLED Monitors for Avid Gamers           PR Newswire         Four new models include flagship Predator Z57 featuring&#xA0;dual UHD (7680x2160) resolution at 120 Hz       Editor's Summary:         Award-winning Predator gam...",
            "url": "https://www.investorsobserver.com/news/qm-pr/6541397040647624",
            "urlToImage": "https://s3.amazonaws.com/images.investorsobserver.com/io-logo-800x450.jpg",
            "publishedAt": "2024-01-07T12:15:00Z",
            "content": "Four new models include flagship Predator Z57 featuring dual UHD (7680x2160) resolution at 120 Hz\r\nEditor's Summary:\r\n<ul><li>\r\n Award-winning Predator gaming line expands with four new monitors– two… [+7559 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Forbes"
            },
            "author": "Brett Owens, Contributor, \n Brett Owens, Contributor\n https://www.forbes.com/sites/brettowens/",
            "title": "Dogs Of The Dow 2024: 10 Blue-Chip Dividend Payers",
            "description": "This year’s Dogs yield more than three-times the broader market’s paltry payout. So, should we hold our noses and buy?",
            "url": "https://www.forbes.com/sites/brettowens/2024/01/07/dogs-of-the-dow-2024-10-blue-chip-dividend-payers/",
            "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/5e0e14c60bf81b00072e5836/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
            "publishedAt": "2024-01-07T12:15:00Z",
            "content": "Happy smiling young golden retriever dog under light gray plaid. Pet warms under a blanket in cold ... [+] winter weather. Pets friendly and care concept.\r\nGetty\r\nThe 2024 Dogs of the Dow are particu… [+12254 chars]"
        },
        {
            "source": {
                "id": "business-insider",
                "name": "Business Insider"
            },
            "author": "Amy Morin",
            "title": "7 career-boosting habits of mentally strong people, according to a psychotherapist",
            "description": "Acting mentally strong can help people level up their careers, Amy Morin says. Over time, you might start viewing yourself as an unstoppable force.",
            "url": "https://www.businessinsider.com/habits-mentally-strong-people-boost-level-up-career-2024-1",
            "urlToImage": "https://i.insider.com/65986c7c1c5c7b8c9a0e85ce?width=1200&format=jpeg",
            "publishedAt": "2024-01-07T12:14:01Z",
            "content": "Johner Images/Getty Images\r\n<ul><li>Amy Morin is a psychotherapist, licensed clinical social worker, and bestselling author.</li><li>She says mentally strong people have seven habits that anyone can … [+4329 chars]"
        },
        {
            "source": {
                "id": "fox-news",
                "name": "Fox News"
            },
            "author": "Stephen Sorace",
            "title": "Nashville man kills wife with hammer on New Year's Day, buries her body in 6-foot grave: police",
            "description": "Joseph Glynn, 70, allegedly smashed his wife in the head with a hammer, killing her, on New Year's Day at their Nashville home before burying her body.",
            "url": "https://www.foxnews.com/us/nashville-man-kills-wife-hammer-new-years-day-buries-body-6-foot-grave-police",
            "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2024/01/glynns-split-thumb.jpg",
            "publishedAt": "2024-01-07T12:13:34Z",
            "content": "Read this article for free!\r\nPlus get unlimited access to thousands of articles, videos and more with your free account!\r\nPlease enter a valid email address.\r\nBy entering your email, you are agreeing… [+2180 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Slashdot.org"
            },
            "author": "feedfeeder",
            "title": "Lloyd Austin taking 'full responsibility' for keeping the White House in the dark - ABC News",
            "description": "Lloyd Austin taking 'full responsibility' for keeping the White House in the darkABC News GOP senators outraged over 'shocking breakdown' related to Defense Sec Lloyd Austin's secret hospitalizationFox News Biden wasn’t aware for days that Defense Secretary A…",
            "url": "https://slashdot.org/firehose.pl?op=view&amp;id=172690488",
            "urlToImage": null,
            "publishedAt": "2024-01-07T12:13:33Z",
            "content": "Sign up for the Slashdot newsletter! OR check out the new Slashdot job board to browse remote jobs or jobs in your areaDo you develop on GitHub? You can keep using GitHub but automatically sync your … [+268 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Slashdot.org"
            },
            "author": "feedfeeder",
            "title": "Bangladesh election: Voting begins in polls fraught with violence - The Associated Press",
            "description": "Bangladesh election: Voting begins in polls fraught with violenceThe Associated Press Bangladesh election: How credible will result be after BNP boycott? | DW NewsDW News Polls open in Bangladesh election boycotted by oppositionCNN In Bangladesh, a Raging 'On…",
            "url": "https://slashdot.org/firehose.pl?op=view&amp;id=172690484",
            "urlToImage": null,
            "publishedAt": "2024-01-07T12:13:11Z",
            "content": "Sign up for the Slashdot newsletter! OR check out the new Slashdot job board to browse remote jobs or jobs in your areaDo you develop on GitHub? You can keep using GitHub but automatically sync your … [+268 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Slashdot.org"
            },
            "author": "feedfeeder",
            "title": "FAA to temporarily ground certain Boeing planes after Alaska Airlines door blew off in midair - Fox Business",
            "description": "FAA to temporarily ground certain Boeing planes after Alaska Airlines door blew off in midairFox Business US grounds Boeing 737 Max 9 jets after mid-air emergency | BBC NewsBBC News Scare on Alaska Airlines Flight 1282: A loud bang, a whooshing sound and a bo…",
            "url": "https://slashdot.org/firehose.pl?op=view&amp;id=172690482",
            "urlToImage": null,
            "publishedAt": "2024-01-07T12:12:52Z",
            "content": "Sign up for the Slashdot newsletter! OR check out the new Slashdot job board to browse remote jobs or jobs in your areaDo you develop on GitHub? You can keep using GitHub but automatically sync your … [+268 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Birtles.blog"
            },
            "author": "Brian Birtles",
            "title": "Weird things engineers believe about Web development",
            "description": "I wrote most of this post sometime in 2022 but I think it holds up alright in 2024 so I decided to publish it for posterity. I don’t really like doing posts like this—I’d much rather share some innocuous learnings or tips but it turns out I have opinions too …",
            "url": "https://birtles.blog/2024/01/06/weird-things-engineers-believe-about-development/",
            "urlToImage": "https://birtles.blog/2024/01/06/weird-things-engineers-believe-about-development/social.png",
            "publishedAt": "2024-01-07T12:11:32Z",
            "content": "I wrote most of this post sometime in 2022 but I think it holds up alright\r\nin 2024 so I decided to publish it for posterity.\r\nI dont really like doing posts like thisId much rather share some\r\ninnoc… [+19880 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "CleanTechnica"
            },
            "author": "Zachary Shahan",
            "title": "Building Communities & Decarbonizing Enterprises with Software",
            "description": "Decarbonization is today’s challenge for everyone, and that includes corporations of all sizes and types. When it comes to making ... [continued]\nThe post Building Communities & Decarbonizing Enterprises with Software appeared first on CleanTechnica.",
            "url": "https://cleantechnica.com/2024/01/07/building-communities-decarbonizing-enterprises-with-software/",
            "urlToImage": "https://cleantechnica.com/wp-content/uploads/2024/01/Zeigo-Podcast-Ian-Lawrence-CleanTech-Talk.png",
            "publishedAt": "2024-01-07T12:10:38Z",
            "content": "Sign up for daily news updates from CleanTechnica on email. Or follow us on Google News!\r\nDecarbonization is todays challenge for everyone, and that includes corporations of all sizes and types. When… [+5063 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "InvestorsObserver"
            },
            "author": "InvestorsObserver",
            "title": "ISOMORPHIC LABS ANNOUNCES STRATEGIC MULTI-TARGET RESEARCH COLLABORATION WITH NOVARTIS",
            "description": "ISOMORPHIC LABS ANNOUNCES STRATEGIC MULTI-TARGET RESEARCH COLLABORATION WITH NOVARTIS           PR Newswire         Isomorphic Labs to Receive   $37.5 Million   Upfront Payment From Novartis to Collaborate on Small Molecule Therapeutics Discovery      ...",
            "url": "https://www.investorsobserver.com/news/qm-pr/7362241996601229",
            "urlToImage": "https://s3.amazonaws.com/images.investorsobserver.com/io-logo-800x450.jpg",
            "publishedAt": "2024-01-07T12:10:00Z",
            "content": "Isomorphic Labs to Receive\r\n$37.5 Million\r\nUpfront Payment From Novartis to Collaborate on Small Molecule Therapeutics Discovery\r\nLONDON\r\n,\r\nJan. 7, 2024\r\n/PRNewswire/ -- Isomorphic Labs, a digital b… [+3762 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "InvestorsObserver"
            },
            "author": "InvestorsObserver",
            "title": "ISOMORPHIC LABS ANNOUNCES STRATEGIC MULTI-TARGET RESEARCH COLLABORATION WITH LILLY",
            "description": "ISOMORPHIC LABS ANNOUNCES STRATEGIC MULTI-TARGET RESEARCH COLLABORATION WITH LILLY           PR Newswire         Isomorphic Labs to Receive   $45 Million   in Upfront Payment with Potential&#xA0;Total Deal Value up to   $1.7 Billion           LONDON   ...",
            "url": "https://www.investorsobserver.com/news/qm-pr/6417564229130505",
            "urlToImage": "https://s3.amazonaws.com/images.investorsobserver.com/io-logo-800x450.jpg",
            "publishedAt": "2024-01-07T12:10:00Z",
            "content": "Isomorphic Labs to Receive\r\n$45 Million\r\nin Upfront Payment with Potential Total Deal Value up to\r\n$1.7 Billion\r\nLONDON\r\n,\r\nJan. 7, 2024\r\n/PRNewswire/ -- Isomorphic Labs, a digital biology company wi… [+3165 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "InvestorsObserver"
            },
            "author": "InvestorsObserver",
            "title": "Acer Expands SpatialLabs Stereoscopic 3D Portfolio with New Laptop and Gaming Monitor",
            "description": "Acer Expands SpatialLabs Stereoscopic 3D Portfolio with New Laptop and Gaming Monitor           PR Newswire         The Aspire 3D 15 SpatialLabs Edition Laptop delivers captivating 3D content for entertainment, while the Predator SpatialLabs View 27 ga...",
            "url": "https://www.investorsobserver.com/news/qm-pr/7010633041944318",
            "urlToImage": "https://s3.amazonaws.com/images.investorsobserver.com/io-logo-800x450.jpg",
            "publishedAt": "2024-01-07T12:10:00Z",
            "content": "The Aspire 3D 15 SpatialLabs Edition Laptop delivers captivating 3D content for entertainment, while the Predator SpatialLabs View 27 gaming monitor takes 3D gaming experiences to new heights\r\nLAS VE… [+8438 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Antaranews.com"
            },
            "author": "Asep F, Tegar Nurfitra",
            "title": "Minister Qoumas heading to Saudi Arabia to discuss Hajj-related guide",
            "description": "Religious Affairs Minister Yaqut Cholil Qoumas, on Sunday, headed to Saudi Arabia to discuss the Ta'limatul Hajj, or the Ministry of Hajj and Umra of the gulf state's guidance regarding Hajj.\r\n\"Today, ...",
            "url": "https://en.antaranews.com/news/302583/minister-qoumas-heading-to-saudi-arabia-to-discuss-hajj-related-guide",
            "urlToImage": "https://cdn.antaranews.com/cache/1200x800/2024/01/07/IMG-20240107-WA0000_3.jpg",
            "publishedAt": "2024-01-07T12:09:53Z",
            "content": "Religious Affairs Minister YaqutCholilQoumas, on Sunday, headed to Saudi Arabia to discuss the Ta'limatul Hajj, or the Ministry of Hajj and Umra of the gulf state's guidance regarding Hajj.\"Today, we… [+1679 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Sky.com"
            },
            "author": null,
            "title": "Man and teenage boy die after car left road and became submerged in water",
            "description": "A 16-year-old boy and 40-year-old man have died after a blue Mercedes left the road and became submerged in water.",
            "url": "https://news.sky.com/story/tetney-lock-boy-16-and-40-year-old-man-die-after-car-left-road-and-became-submerged-in-water-13043546",
            "urlToImage": "https://e3.365dm.com/24/01/1600x900/skynews-tetney-lock-tetney-lock-road_6414089.jpg?20240107123111",
            "publishedAt": "2024-01-07T12:09:00Z",
            "content": "A 16-year-old boy and 40-year-old man have died after a blue Mercedes left the road and became submerged in water.\r\nLincolnshire Police said the pair were pronounced dead at the scene in Tetney Lock.… [+827 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Freerepublic.com"
            },
            "author": "Gracetoyou.org",
            "title": "Divine Resources for Walking Worthy - Protestant Caucus/Devotional",
            "description": "“I, therefore, the prisoner of the Lord, entreat you to walk in a manner worthy of the calling with which you have been called” (Ephesians 4:1). A worthy lifestyle is possible only by depending on God’s resources. Walking is often used in Scripture as a symbo…",
            "url": "https://freerepublic.com/focus/f-religion/4208355/posts",
            "urlToImage": null,
            "publishedAt": "2024-01-07T12:07:27Z",
            "content": "Skip to comments.\r\nDivine Resources for Walking Worthy - Protestant Caucus/DevotionalGracetoyou.org ^\r\n | 1997\r\n | John McArthur, Grace Community Church\r\nPosted on 01/07/2024 4:07:27 AM PST by metmom… [+3187 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Thepinknews.com"
            },
            "author": "Maggie Baska",
            "title": "Taylor Swift and the NYT: Here’s why it’s not OK to speculate about celebs’ sexuality",
            "description": "Taylor Swift’s team is reportedly fuming after the New York Times published an article speculating about the record-breaking, multi-award winning pop icon’s sexuality.  In the New York Times (NYT) op-ed, published Thursday (4 January), the writer claimed ther…",
            "url": "https://www.thepinknews.com/2024/01/07/taylor-swift-queer-new-york-times-op-ed-speculation-sexuality/",
            "urlToImage": "https://www.thepinknews.com/wp-content/uploads/2024/01/taylor-swift-new-york-times-queer-sexuality-speculation.jpg",
            "publishedAt": "2024-01-07T12:06:18Z",
            "content": "Taylor Swifts team is reportedly fuming after the New York Times published an article speculating about the record-breaking, multi-award winning pop icon’s sexuality. \r\nIn the New York Times (NYT) op… [+7251 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Marketscreener.com"
            },
            "author": null,
            "title": "Ukraine's Zelenskiy says Russian aggression can be defeated",
            "description": "(marketscreener.com) Russia's attack on Ukraine can be defeated, President Volodymyr Zelenskiy said on Sunday, while adding that the situation on the battlefield at this time remains relatively stable.https://www.marketscreener.com/quote/currency/US-DOLLAR-RU…",
            "url": "https://www.marketscreener.com/news/latest/Ukraine-s-Zelenskiy-says-Russian-aggression-can-be-defeated-45688102/",
            "urlToImage": "https://www.marketscreener.com/images/reuters/2024-01/2024-01-02T021753Z_1_LYNXMPEK0101E_RTROPTP_3_UKRAINE-CRISIS-ZELENSKIY-ECONOMIST.JPG",
            "publishedAt": "2024-01-07T12:05:02Z",
            "content": "Court cancels Warren Buffett, Jimmy Haslam trial over Pilot\r\nWILMINGTON, Delaware (Reuters) - An unusual, billion-dollar trial between Warren Buffett's Berkshire Hathaway and the billionaire Haslam f… [+86 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "InvestorsObserver"
            },
            "author": "InvestorsObserver",
            "title": "Acer Debuts Carbon-Neutral Aspire Vero 16 with Latest Intel Core Ultra Processors",
            "description": "Acer Debuts Carbon-Neutral Aspire Vero 16 with Latest Intel Core Ultra Processors           PR Newswire         Acer also announces the first Aspire Go laptops with multiple processor and display options, made accessible for everyday users       Editor...",
            "url": "https://www.investorsobserver.com/news/qm-pr/7863768194565035",
            "urlToImage": "https://s3.amazonaws.com/images.investorsobserver.com/io-logo-800x450.jpg",
            "publishedAt": "2024-01-07T12:05:00Z",
            "content": "Acer also announces the first Aspire Go laptops with multiple processor and display options, made accessible for everyday users\r\nEditor's Summary\r\n<ul><li>\r\n Acer debuts the new Aspire Vero 16 AI PC,… [+11051 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "ETF Daily News"
            },
            "author": "MarketBeat News",
            "title": "Brokerages Set Citigroup Inc. (NYSE:C) PT at $52.62",
            "description": "Shares of Citigroup Inc. (NYSE:C – Get Free Report) have received an average rating of “Hold” from the sixteen ratings firms that are presently covering the firm, Marketbeat reports. One analyst has rated the stock with a sell recommendation, seven have assig…",
            "url": "https://www.etfdailynews.com/2024/01/07/brokerages-set-citigroup-inc-nysec-pt-at-52-62/",
            "urlToImage": "https://www.americanbankingnews.com/wp-content/timthumb/timthumb.php?src=https://www.marketbeat.com/logos/citigroup-inc-logo.png&w=240&h=240&zc=2",
            "publishedAt": "2024-01-07T12:04:41Z",
            "content": "Shares of Citigroup Inc. (NYSE:C – Get Free Report) have received an average rating of “Hold” from the sixteen ratings firms that are presently covering the firm, Marketbeat reports. One analyst has … [+5337 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Biztoc.com"
            },
            "author": "vox.com",
            "title": "The shoplifting scare might not have been real",
            "description": "New York City Mayor Eric Adams speaks during a press conference on reducing shoplifting. | Barry Williams/NY Daily News via Getty Images It turns out shoplifting isn’t spiraling out of control, but lawmakers are pushing for tougher penalties for low-level and…",
            "url": "https://biztoc.com/x/66facd2fdc0cc5c1",
            "urlToImage": "https://c.biztoc.com/p/66facd2fdc0cc5c1/s.webp",
            "publishedAt": "2024-01-07T12:04:06Z",
            "content": "New York City Mayor Eric Adams speaks during a press conference on reducing shoplifting. | Barry Williams/NY Daily News via Getty Images\r\nIt turns out shoplifting isnt spiraling out of control, but l… [+288 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "ILoveQatar.net"
            },
            "author": null,
            "title": "Shopping offers of the week: 7 - 13 January 2024",
            "description": "This week, shop up to 75% off on makeup and cosmetics, great deals on electronics and accessories, discounted furniture and homeware, and more!",
            "url": "https://www.iloveqatar.net/news/business/shopping-offers-deals-promotions-7-13-january-2024",
            "urlToImage": "https://d12eu00glpdtk2.cloudfront.net/public/images/news/shopping-offers-deals-promotions-7-13-january-2024/_760x500_clip_center-center_none/shopping-offers-deals-promotions-7-13-january-2024.jpg",
            "publishedAt": "2024-01-07T12:04:02Z",
            "content": "Do you love to shop, and are you always looking for offers to save up? You've come to the right place!\r\nThe ILoveQatar.net (ILQ) team has put together some sweet deals for you to make the most of thi… [+2623 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "BBC News"
            },
            "author": "Shaimaa Khalil",
            "title": "Al Jazeera bureau chief's son Hamza al-Dahdouh among journalists killed in Gaza",
            "description": "Hamza al-Dahdouh was with other journalists when a reported strike hit a road between Khan Younis and Rafah.",
            "url": "https://www.bbc.com/news/world-middle-east-67905566",
            "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/13B5C/production/_132223708_adsz.png",
            "publishedAt": "2024-01-07T12:03:36Z",
            "content": "By Shaimaa KhalilBBC News, Jerusalem\r\nHamza Al-Dahdouh (right) and his father Wael Al-Dahdouh\r\nThe eldest son of Al Jazeera's Gaza bureau chief has been killed in an Israeli strike in southern Gaza. … [+3808 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Marketscreener.com"
            },
            "author": null,
            "title": "LIBYA'S NOC SAYS NEGOTIATIONS ONGOING TO RESUME PRODUCTION AS SO…",
            "description": "(marketscreener.com) \n LIBYAS NOC SAYS NEGOTIATIONS ONGOING TO RESUME PRODUCTION AS SOON AS POSSIBLE - STATEMENT\n https://www.marketscreener.com/news/latest/LIBYA-S-NOC-SAYS-NEGOTIATIONS-ONGOING-TO-RESUME-PRODUCTION-AS-SO-8230--45688100/?utm_medium=RSS&utm_c…",
            "url": "https://www.marketscreener.com/news/latest/LIBYA-S-NOC-SAYS-NEGOTIATIONS-ONGOING-TO-RESUME-PRODUCTION-AS-SO--45688100/",
            "urlToImage": "https://www.marketscreener.com/images/twitter_MS_fdnoir.png",
            "publishedAt": "2024-01-07T12:03:08Z",
            "content": "Court cancels Warren Buffett, Jimmy Haslam trial over Pilot\r\nWILMINGTON, Delaware (Reuters) - An unusual, billion-dollar trial between Warren Buffett's Berkshire Hathaway and the billionaire Haslam f… [+86 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Marketscreener.com"
            },
            "author": null,
            "title": "Libya's NOC declares force majeure at Sharara oilfield",
            "description": "(marketscreener.com) Libya's National Oil Company\n on Sunday declared force majeure at its Sharara oilfield\non the back of protests.\n The force majeure is effective as of Sunday at the field\nwhich can produce up to 300,000 barrels per day of oil.\n Negotiation…",
            "url": "https://www.marketscreener.com/news/latest/Libya-s-NOC-declares-force-majeure-at-Sharara-oilfield-45688105/",
            "urlToImage": "https://www.marketscreener.com/images/twitter_MS_fdnoir.png",
            "publishedAt": "2024-01-07T12:03:08Z",
            "content": "DUBAI, Jan 7 (Reuters) - Libya's National Oil Company\r\n(NOC) on Sunday declared force majeure at its Sharara oilfield\r\non the back of protests.\r\nThe force majeure is effective as of Sunday at the fie… [+219 chars]"
        },
        {
            "source": {
                "id": "fox-news",
                "name": "Fox News"
            },
            "author": "Anders Hagstrom",
            "title": "MSNBC host fights back tears during Jan. 6 segment: ‘I’m going to try to get through this’",
            "description": "MSNBC host Jonathan Capehart appeared to cry during an interview with former Capitol Hill police officer Michael Fanone on the anniversary of Jan. 6.",
            "url": "https://www.foxnews.com/politics/msnbc-host-fights-back-tears-jan-6-segment-im-going-to-try-to-get-this",
            "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2024/01/GettyImages-1599558685.jpg",
            "publishedAt": "2024-01-07T12:02:57Z",
            "content": "MSNBC host Jonathan Capehart got weepy during a segment featuring a former member of the Capitol Hill Police Department who served during the Jan. 6, 2021 storming of the U.S. Capitol.\r\nCapehart was … [+2696 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Marketscreener.com"
            },
            "author": null,
            "title": "LIBYA'S NATIONAL OIL CORP DECLARES FORCE MAJEURE IN SHARARA OILF…",
            "description": "(marketscreener.com) \n LIBYA'S NATIONAL OIL CORP DECLARES FORCE MAJEURE IN SHARARA OILFIELD EFFECTIVE SUNDAY, JAN.7 DUE TO ITS CLOSURE BY PROTESTERS - STATEMENT\n https://www.marketscreener.com/news/latest/LIBYA-S-NATIONAL-OIL-CORP-DECLARES-FORCE-MAJEURE-IN-SH…",
            "url": "https://www.marketscreener.com/news/latest/LIBYA-S-NATIONAL-OIL-CORP-DECLARES-FORCE-MAJEURE-IN-SHARARA-OILF--45688099/",
            "urlToImage": "https://www.marketscreener.com/images/twitter_MS_fdblanc.png",
            "publishedAt": "2024-01-07T12:02:20Z",
            "content": "Court cancels Warren Buffett, Jimmy Haslam trial over Pilot\r\nWILMINGTON, Delaware (Reuters) - An unusual, billion-dollar trial between Warren Buffett's Berkshire Hathaway and the billionaire Haslam f… [+86 chars]"
        },
        {
            "source": {
                "id": "abc-news-au",
                "name": "ABC News (AU)"
            },
            "author": "ABC News",
            "title": "Japanese prosecutors make their first arrest in $6.19 million fundraising scandal sweeping the ruling party",
            "description": "Japanese prosecutors make their first arrest on Sunday in connection with a major political slush funds scandal that has rocked Prime Minister Fumio Kishida's already unpopular government.",
            "url": "https://www.abc.net.au/news/2024-01-07/japan-makes-arrest-in-party-scandal/103291946",
            "urlToImage": "https://live-production.wcms.abc-cdn.net.au/7819d706e9c7f57c01fd902f0d1d9b52?impolicy=wcms_crop_resize&cropH=1688&cropW=3000&xPos=0&yPos=224&width=862&height=485",
            "publishedAt": "2024-01-07T12:01:34Z",
            "content": "Japanese prosecutors made their first arrest on Sunday in connection with a major political slush funds scandal that has rocked Prime Minister Fumio Kishida's already unpopular government.\r\n<ul><li>T… [+4181 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "The Boston Globe"
            },
            "author": "The Associated Press",
            "title": "Nadal withdraws from the Australian Open with an injury just one tournament into his comeback",
            "description": "Rafael Nadal withdrew from the Australian Open with an injury a week before the season's first major was due to start after playing just one tournament in his comeback from 12 months on the sidelines.",
            "url": "https://www.bostonglobe.com/2024/01/07/sports/nadal-withdraws-australian-open-with-an-injury-just-one-tournament-into-his-comeback/",
            "urlToImage": "https://bostonglobe-prod.cdn.arcpublishing.com/resizer/4iQK6pgxAlf5425soVLgvElGUM8=/506x0/cloudfront-us-east-1.images.arcpublishing.com/bostonglobe/ENU2DYTIYL7SAXP24P6R7DW7ME.jpg",
            "publishedAt": "2024-01-07T12:01:26Z",
            "content": "But he posted on social media Sunday that scans after he arrived in Melbourne revealed a small tear in the muscle and he was flying back to Spain for treatment.\r\nHi all, during my last match in Brisb… [+2462 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Mpasho.co.ke"
            },
            "author": "Maureen Waruinge",
            "title": "Mumeniroga moja imepotea-Amber Ray updates fans on baby journey",
            "description": "The New Year has kicked off with Amber Ray speaking out about planned parenthood. The socialite was in her baby daddy's Range Rover, out and about,",
            "url": "https://mpasho.co.ke/entertainment/2024-01-07-mumeniroga-moja-imepotea-amber-ray-updates-fans-on-baby-journey/",
            "urlToImage": "https://lh3.googleusercontent.com/q5HovrrKdBJBQxxNkEQZDxMtSHHPsJ_G-9RD7OiWhGolCdnng_uIkAbsnQoYllP_Nr0zWYXNx0EvqafRwvG6_4GqDmTwnd7O2xBq--Q=s1000",
            "publishedAt": "2024-01-07T12:01:02Z",
            "content": "Amber announced her pregnancy a year ago today in January 2023, with a joyous post about the news.\r\n\"Oh boy,\" she captioned a picture in a house with her fiance Keneddy Rapudo.\r\nShe showed a pregnanc… [+799 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Decrypt"
            },
            "author": "Ryan Kawailani Ozawa,Sander Lutz",
            "title": "This Week on Crypto Twitter: ETF Fever Won’t Break",
            "description": "Rumors and predictions about a looming spot Bitcoin ETF approval ran rampant this week, spiking nerves and crypto prices alike.",
            "url": "https://decrypt.co/211905/this-week-on-crypto-twitter-etf-fever-wont-break",
            "urlToImage": "https://cdn.decrypt.co/resize/1024/height/512/wp-content/uploads/2023/08/bitcoin-btc-etf-gID_7.jpg",
            "publishedAt": "2024-01-07T12:01:02Z",
            "content": "Illustration by Mitchell Preffer for Decrypt\r\nETF fever has taken over the body of cryptoand now appears to have a grip on markets and discourse so all-consuming that it likely wont let up until the … [+2916 chars]"
        },
        {
            "source": {
                "id": "usa-today",
                "name": "USA Today"
            },
            "author": "Aggies Wire",
            "title": "Way-too-early 2024 Heisman odds: Texas A&M QB Conner Weigman cracks top 5",
            "description": "Aggies quarterback Conner Weigman has come a long way in the eyes of betters in Las Vegas as he has sky-rocketed up the Heisman Trophy odds.",
            "url": "https://aggieswire.usatoday.com/2024/01/07/texas-aggies-football-conner-weigman-heisman-trophy-odds/",
            "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png",
            "publishedAt": "2024-01-07T12:00:59Z",
            "content": "Texas A&amp;M quarterback Conner Weigman has come a long way in the eyes of betters in Las Vegas as he has sky-rocketed up the 2024 Heisman Trophy odds.\r\nEntering his sophomore season in 2023, Weigma… [+1173 chars]"
        },
        {
            "source": {
                "id": "bleacher-report",
                "name": "Bleacher Report"
            },
            "author": "Joe Tansey",
            "title": "CFP National Championship 2024: Location, Odds and Guide for Washington vs. Michigan",
            "description": "College football will crown a national champion on Monday in Houston. The top-ranked Michigan Wolverines and second-seeded Washington Huskies will square off…",
            "url": "https://bleacherreport.com/articles/10103927-cfp-national-championship-2024-location-odds-and-guide-for-washington-vs-michigan",
            "urlToImage": "https://media.bleacherreport.com/image/upload/c_fill,g_faces,w_3800,h_2000,q_95/v1704627959/ac9xljnrqggheun5qftw.jpg",
            "publishedAt": "2024-01-07T12:00:52Z",
            "content": "Sean Gardner/Getty Images\r\nWashington is flying the flag for west coast football.\r\nA Pac-12 team has not won the national championship in the playoff era and the Oregon Ducks in 2014 were the only ot… [+1476 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Openstreetmap.org"
            },
            "author": "Sawan Shariar",
            "title": "OpenStreetMap Bangladesh Election 2024 Announcement! ️",
            "description": "Dear OSM Bangladesh Voting Members,\n\nThe elected Election Commission has announced the exciting news about the upcoming OSM Bangladesh Election 2024! Since the formalization of our official structure in February 2023, we’ve witnessed incredible growth and col…",
            "url": "https://www.openstreetmap.org/user/Sawan%20Shariar/diary/403195",
            "urlToImage": "https://www.openstreetmap.org/assets/osm_logo_256-ed028f90468224a272961c380ecee0cfb73b8048b34f4b4b204b7f0d1097875d.png",
            "publishedAt": "2024-01-07T12:00:47Z",
            "content": "Dear OSM Bangladesh Voting Members,\r\nThe elected Election Commission has announced the exciting news about the upcoming OSM Bangladesh Election 2024! Since the formalization of our official structure… [+1652 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "NPR"
            },
            "author": "Jaclyn Diaz",
            "title": "Art and war: Israeli and Palestinian artists reflect on Oct.7 and the crisis in Gaza",
            "description": "We asked six Israeli and Palestinian artists about how the outbreak of war between Israel and Hamas has affected their lives and their work. They shared stories of fear, anger, sadness and pain.",
            "url": "https://www.npr.org/2024/01/07/1222578695/gaza-october-7-art-israel-palestinians",
            "urlToImage": "https://media.npr.org/assets/img/2024/01/05/dsc_1822_wide-f58eb1f17731a689ae49838ca185d48fb4ce26bc-s1400-c100.jpg",
            "publishedAt": "2024-01-07T12:00:47Z",
            "content": "Rana Samara, a Palestinian artist from Ramallah in the Israeli-occupied West Bank.\r\nTanya Habjouqa/NOOR Images for NPR \r\nIn Israel's cultural capital of Tel Aviv, a vibrant artistic community leaves … [+15686 chars]"
        },
        {
            "source": {
                "id": "fox-news",
                "name": "Fox News"
            },
            "author": "Taylor Penley",
            "title": "Younger Americans living with parents longer to save up for a shot at the American dream of home ownership",
            "description": "A Washington Post report on younger Americans living at home with their parents to save up for a home echoes concerns that the cost of living has skyrocketed in recent years.",
            "url": "https://www.foxnews.com/media/younger-americans-living-parents-longer-save-american-dream-home-ownership",
            "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2024/01/For-Sale-home-sign.jpg",
            "publishedAt": "2024-01-07T12:00:46Z",
            "content": "Read this article for free!\r\nPlus get unlimited access to thousands of articles, videos and more with your free account!\r\nPlease enter a valid email address.\r\nBy entering your email, you are agreeing… [+4460 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Kevinmd.com"
            },
            "author": "Katherine Pannel, DO",
            "title": "Are convenience stores making addiction convenient?",
            "description": "It is not breaking news that we are currently in the midst of a mental health and substance use disorder crisis. We saw a record number of overdose deaths in a 12-month period from May 2022 to May 2023. According to the CDC, overdose deaths totaled more than …",
            "url": "https://www.kevinmd.com/2024/01/are-convenience-stores-making-addiction-convenient.html",
            "urlToImage": "https://www.kevinmd.com/wp-content/uploads/shutterstock_1616603689.jpg",
            "publishedAt": "2024-01-07T12:00:41Z",
            "content": "It is not breaking news that we are currently in the midst of a mental health and substance use disorder crisis. We saw a record number of overdose deaths in a 12-month period from May 2022 to May 20… [+4334 chars]"
        },
        {
            "source": {
                "id": "fox-news",
                "name": "Fox News"
            },
            "author": "Madeline Coggins",
            "title": "Apple Watch feature saves woman from near-fatal carbon monoxide poisoning: I was 'extremely scared'",
            "description": "Natalie Nasatka recounts her near-deadly exposure to carbon monoxide on 'Fox & Friends' and shares how her Apple Watch helped save her life.",
            "url": "https://www.foxnews.com/media/apple-watch-feature-saves-woman-near-fatal-carbon-monoxide-poisoning-extremely-scared",
            "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2024/01/Apple-Watch-saves-woman.png",
            "publishedAt": "2024-01-07T12:00:40Z",
            "content": "An Apple Watch safety feature is being credited with helping save a woman's life after she was exposed to near-fatal levels of carbon monoxide.\r\nWilmington University graduate student Natalie Nasatka… [+2586 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Los Angeles Times"
            },
            "author": "Tyler R. Tynes",
            "title": "Pam Oliver's unyielding resolve to stay in the game",
            "description": "Fox Sports sideline reporter Pam Oliver, who has shrugged off a litany of obstacles to set a record for most NFL games called, isn't ready to retire.",
            "url": "https://www.latimes.com/sports/story/2024-01-07/pam-oliver-resolve-nfl-broadcasting",
            "urlToImage": "https://ca-times.brightspotcdn.com/dims4/default/bad4476/2147483647/strip/true/crop/8254x4333+1+1171/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F49%2F2a%2Faebc84bf45e0bbcb42bd970fdf33%2F49ers-jaguars-football-91886.jpg",
            "publishedAt": "2024-01-07T12:00:21Z",
            "content": "She sat there, all smiles and shell tops, without the benefit of a Fox flag or microphone to shield herself, painted into a mundane conference room thatd heard the stale chatter of production plannin… [+24442 chars]"
        },
        {
            "source": {
                "id": "the-times-of-india",
                "name": "The Times of India"
            },
            "author": "Neha Maheshwri",
            "title": "Exclusive: Isha and I got divorced in November last year, confirms Timmy Narang",
            "description": "Restaurateur Timmy Narang, who was married to actress Isha Koppikar, confirms the news of their divorce. He also said that Isha has moved out of their house along with their daughter, Rianna.",
            "url": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/exclusive-isha-and-i-got-divorced-in-november-last-year-confirms-timmy-narang/articleshow/106613971.cms",
            "urlToImage": "https://static.toiimg.com/thumb/msid-106614000,width-1070,height-580,imgsize-42854,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
            "publishedAt": "2024-01-07T12:00:10Z",
            "content": "Aamir Khan gives a peck on ex-wife Kiran Rao's cheek at Ira Khans wedding; netizen says, 'They still love each other'"
        },
        {
            "source": {
                "id": null,
                "name": "Biztoc.com"
            },
            "author": "foxbusiness.com",
            "title": "FAA to temporarily ground certain Boeing planes after Alaska Airlines door blew off in midair",
            "description": "The Federal Aviation Administration announced a temporary grounding and inspections of certain Boeing 737 Max 9 planes after an Alaska Airlines flight was forced to make an emergency landing Friday night in Portland, Oregon, when a door blew out of the aircra…",
            "url": "https://biztoc.com/x/46563d16c1e7b83b",
            "urlToImage": "https://c.biztoc.com/p/46563d16c1e7b83b/og.webp",
            "publishedAt": "2024-01-07T12:00:10Z",
            "content": "The Federal Aviation Administration announced a temporary grounding and inspections of certain Boeing 737 Max 9 planes after an Alaska Airlines flight was forced to make an emergency landing Friday n… [+294 chars]"
        },
        {
            "source": {
                "id": "newsweek",
                "name": "Newsweek"
            },
            "author": "Thomas Westerholm",
            "title": "Former NFL Star: Cowboys Should Rest Some Starters in Must-Win Game",
            "description": "Richard Sherman believes the Cowboys should rest their starters against the Washington Commanders on Sunday.",
            "url": "https://www.newsweek.com/richard-sherman-cowboys-rest-starts-must-win-game-1858229",
            "urlToImage": "https://d.newsweek.com/en/full/2331975/dallas-cowboys.jpg",
            "publishedAt": "2024-01-07T12:00:02Z",
            "content": "The Dallas Cowboys are on the verge of clinching the No. 2 seed in the National Football Conference (NFC) and winning the NFC East for the second time in three years.\r\nTo do so, the Cowboys just need… [+3850 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Nbcsportsphiladelphia.com"
            },
            "author": "NBC Sports Philadelphia",
            "title": "What D'Andre Swift proved with his Pro Bowl season",
            "description": "D'Andre Swift had a Pro Bowl season with the Eagles in 2023 and proved plenty to the NFL.",
            "url": "https://www.nbcsportsphiladelphia.com/nfl/philadelphia-eagles/what-dandre-swift-proved-with-his-pro-bowl-season/556531/?partner=yahoo",
            "urlToImage": "https://s.yimg.com/ny/api/res/1.2/41oCWGti7.y7RKKahPYNyg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/csnphilly.com/eb14141d83a8643c3cd40da8cc805d4a",
            "publishedAt": "2024-01-07T12:00:00Z",
            "content": "What D'Andre Swift proved with his Pro Bowl season originally appeared on NBC Sports Philadelphia\r\nThe day before Nick Sirianni announced the Eagles Pro Bowlers to the entire team, he called DAndre S… [+4698 chars]"
        },
        {
            "source": {
                "id": "nbc-news",
                "name": "NBC News"
            },
            "author": "Nnamdi Egwuonwu",
            "title": "GOP candidates skip Iowa’s only minority-focused forum",
            "description": "Nearly every Republican presidential hopeful rejected an offer to join what the organizer describes as the nation’s oldest minority-focused presidential forum.",
            "url": "https://www.nbcnews.com/politics/2024-election/gop-candidates-skip-iowas-only-minority-focused-forum-rcna132202",
            "urlToImage": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-01/240103-wayne-ford-2015-ac-1117p-73ff04.jpg",
            "publishedAt": "2024-01-07T12:00:00Z",
            "content": "Nearly every Republican presidential candidate has rejected an offer to participate in what the organizer describes as the nations oldest minority-focused presidential forum, despite GOP optimism and… [+9094 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Chicago Tribune"
            },
            "author": "Paul Sullivan",
            "title": "Column: Waiting on the Chicago Cubs is not an unfamiliar occurrence for antsy fans",
            "description": "It's almost time for the Cubs Convention, and as of late Saturday, the team had yet to make any offseason moves. Do you know where your Chicago Cubs are?",
            "url": "https://www.chicagotribune.com/sports/cubs/ct-chicago-cubs-jed-hoyer-craig-counsell-20240107-g2b2uutpcrb5jebuuhmh5gdpqy-story.html",
            "urlToImage": "https://www.chicagotribune.com/resizer/vYbELLny6dh1ckEnZOcKdYQ89qQ=/1200x630/filters:format(jpg):quality(70)/cloudfront-us-east-1.images.arcpublishing.com/tronc/6OXP4TYXT5BXPBWWUDXXHZJYJU.JPG",
            "publishedAt": "2024-01-07T12:00:00Z",
            "content": "With the Cubs Convention around the corner, its a good time to remind fans that the Rickettses are only about $1 billion behind the Los Angeles Dodgers owners in offseason spending.\r\nTheres still ple… [+7014 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Cheesehead TV"
            },
            "author": "BruceIrons",
            "title": "Packers vs Bears: Gameday Preview - 2023 Week 18",
            "description": "<!--//--><![CDATA[//><!--\nif(window.da2a)da2a.script_load();\n//--><!]]>\nThe last time the Packers played the Bears was opening day. They went into Chicago on Jordan Love's first game as the starter and spanked the Bears 38-20, earning their 9th straight win i…",
            "url": "https://cheeseheadtv.com/blog/packers-vs-bears-gameday-preview-2023-week-18-229",
            "urlToImage": "https://cheeseheadtv.com/sites/default/files/post/2023/08/gamedaypreview_17.png",
            "publishedAt": "2024-01-07T12:00:00Z",
            "content": "The last time the Packers played the Bears was opening day. They went into Chicago on Jordan Love's first game as the starter and spanked the Bears 38-20, earning their 9th straight win in the series… [+8241 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "The Daily Dot"
            },
            "author": "Kira Deshler",
            "title": "Is ‘Monarch: Legacy of Monsters’ a sci-fi bomb or a touching lesbian love story? Depends who you ask",
            "description": "Decoding Fandom is a weekly column that dives deep into the world of fan culture and runs on Saturdays in the Daily Dot’s web_crawlr newsletter. If you want to get this column a day before we publish it, subscribe to web_crawlr, where you’ll get the daily sco…",
            "url": "https://www.dailydot.com/parsec/fandom/monarch-legacy-of-monsters-fan-responses/",
            "urlToImage": "https://uploads.dailydot.com/2024/01/Monarch-Legacy-of-monsters.jpg?auto=compress&fm=pjpg",
            "publishedAt": "2024-01-07T12:00:00Z",
            "content": "Decoding Fandom is a weekly column that dives deep into the world of fan culture and runs on Saturdays in the Daily Dots web_crawlr newsletter. If you want to get this column a day before we publish … [+3909 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Chicago Tribune"
            },
            "author": "Colleen Kane",
            "title": "Chicago Bears at Green Bay Packers: Everything you need to know about the Week 18 game before kickoff",
            "description": "The 7-9 Chicago Bears will play the 8-8 Green Bay Packers at Lambeau Field in a Week 18 matchup. Here’s what you need to know before kickoff.",
            "url": "https://www.chicagotribune.com/sports/bears/ct-chicago-bears-green-bay-packers-week-18-20240107-ejyswgscr5aidnzabd3acfpmte-story.html",
            "urlToImage": "https://www.chicagotribune.com/resizer/YY-IQyiJ6TXsivOUo_MHx77voGk=/1200x630/filters:format(jpg):quality(70)/cloudfront-us-east-1.images.arcpublishing.com/tronc/ZJZ7UQPSCY777BAJKY7FYV3VIU.jpg",
            "publishedAt": "2024-01-07T12:00:00Z",
            "content": "GREEN BAY, Wis. The 7-9 Chicago Bears will play the 8-8 Green Bay Packers at Lambeau Field in a Week 18 matchup. Heres what you need to know before kickoff (3:25 p.m, CBS-Ch. 2).\r\nBears general manag… [+2489 chars]"
        },
        {
            "source": {
                "id": "abc-news",
                "name": "ABC News"
            },
            "author": "Libby Cathey",
            "title": "Christie launches new 'Truth' ad seemingly intended to draw contrast with Haley",
            "description": "Christie launches new 'Truth' ad seemingly intended to draw contrast with Haleygo.com",
            "url": "https://abcnews.go.com/Politics/christie-launches-new-truth-ad-seemingly-intended-draw/story?id=106162093",
            "urlToImage": "https://i.abcnewsfe.com/a/50fe2b37-0489-4123-a191-cfadb0badaa9/chris-christie-3-ht-gmh-230106_1704635364766_hpMain_16x9.jpg?w=992",
            "publishedAt": "2024-01-07T12:00:00Z",
            "content": "Former New Jersey Gov. Chris Christie launched a new advertisement on Sunday to target independent voters in New Hampshire, seemingly intended to contrast himself with former South Carolina Gov. Nikk… [+5962 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Newser"
            },
            "author": "John Johnson",
            "title": "Biden Didn't Know About Defense Chief's Ailment for 3 Days",
            "description": "The White House press corps and members of Congress are miffed they didn't know defense chief Lloyd Austin was in the hospital . But Politico reports a remarkable addendum to that: President Biden himself didn't know for three days that his secretary was out …",
            "url": "https://www.newser.com/story/344769/defense-chief-i-blew-it-on-hospitalization-secrecy.html",
            "urlToImage": "https://img2-azrcdn.newser.com/image/1510917-12-20240107063002.jpeg",
            "publishedAt": "2024-01-07T12:00:00Z",
            "content": "The Pentagon says Austin resumed his full duties on Friday, though he remains in the Walter Reed National Military Medical Center in Bethesda. He was admitted Jan. 1 for what has been described only … [+1022 chars]"
        },
        {
            "source": {
                "id": "nbc-news",
                "name": "NBC News"
            },
            "author": "Bram Sable-Smith | KFF Health News",
            "title": "Many diagnosed with Type 2 diabetes may actually have a different form of the disease",
            "description": "What are the types of diabetes? Adults with an autoimmune form of diabetes are often misdiagnosed with Type 2 diabetes.",
            "url": "https://www.nbcnews.com/health/diabetes/diagnosed-type-2-diabetes-may-different-form-disease-rcna132571",
            "urlToImage": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-01/240105-Misdiagnosed-Diabetes-Clarke-06-ac-1135p-c14cc2.jpg",
            "publishedAt": "2024-01-07T12:00:00Z",
            "content": "When Phyllisa Deroze was told she had diabetes in a Fayetteville, North Carolina, emergency department years ago, she was handed pamphlets with information on two types of the disease. One had pictur… [+5007 chars]"
        },
        {
            "source": {
                "id": "politico",
                "name": "Politico"
            },
            "author": "Hailey Fuchs, Daniel Lippman and Michael Stratford",
            "title": "Colleges under siege over Israel, Hamas and antisemitism, look to PR giants for help",
            "description": "Some of the top firms, mainly in Democratic politics, are getting calls for help from major universities",
            "url": "https://www.politico.com/news/2024/01/07/colleges-antisemitism-pr-00134179",
            "urlToImage": "https://static.politico.com/54/00/729454f64b52afb9d2468871cce3/https-delivery-gettyimages.com/downloads/1833208996",
            "publishedAt": "2024-01-07T12:00:00Z",
            "content": "While much of the pressure being applied to universities is coming from conservatives, the schools themselves have turned to Democratic-allied firms for help.\r\nNew York University, where in October t… [+6644 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Finbold.com"
            },
            "author": "Paul L.",
            "title": "Experts Highlight Borroe Finance, ORDI, and Polygon as Leading Candidates for Substantial Gains",
            "description": "Cryptocurrency experts have outlined a list of top crypto coins to consider investing in for massive returns. The list comprises … Continue reading\nThe post Experts Highlight Borroe Finance, ORDI, and Polygon as Leading Candidates for Substantial Gains appear…",
            "url": "https://finbold.com/experts-highlight-borroe-finance-ordi-and-polygon-as-leading-candidates-for-substantial-gains/",
            "urlToImage": "https://assets.finbold.com/uploads/2024/01/experts.jpeg",
            "publishedAt": "2024-01-07T12:00:00Z",
            "content": "Press Releases are sponsored content and not a part of Finbold's editorial content. For a full disclaimer, please click here. If you encounter any issues, kindly report them to [email protected]. Cry… [+4277 chars]"
        },
        {
            "source": {
                "id": "politico",
                "name": "Politico"
            },
            "author": "By Alexander Ward, Lara Seligman and Jonathan Lemire",
            "title": "Biden stands by Austin as befuddled White House handles secret hospitalization fallout",
            "description": "The defense chief is facing criticism for keeping his bosses in the dark.",
            "url": "https://www.politico.com/news/2024/01/07/biden-stands-by-austin-as-befuddled-white-house-handles-secret-hospitalization-fallout-00134182",
            "urlToImage": "https://static.politico.com/77/ea/4457fc2b4cd58ba9c27e654cfd6a/https-delivery-gettyimages.com/downloads/1239919482",
            "publishedAt": "2024-01-07T12:00:00Z",
            "content": "Days later, Austins secret hospitalization has spiraled into a drama engulfing the upper echelons of the Biden administration. Senior White House officials are struggling to answer questions about wh… [+6195 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Brooklyn Vegan"
            },
            "author": "Bill Pearis",
            "title": "Watch Toyah & Robert Fripp revisit Hole’s “Celebrity Skin”",
            "description": "After a few weeks of brand-new Sunday Lunch episodes, Toyah and Robert Fripp are revisiting their cover of Hole “Celebrity Skin” where they made special posters for their cupboards: “Celebrity Fripp” and “Hail Queen Courtney.” You can watch that and Hole’s or…",
            "url": "https://www.brooklynvegan.com/watch-toyah-robert-fripp-revisit-holes-celebrity-skin/",
            "urlToImage": "https://www.brooklynvegan.com/wp-content/uploads/2024/01/05/toyah-robert-fripp-hole-celebrity-skin.jpg",
            "publishedAt": "2024-01-07T12:00:00Z",
            "content": "After a few weeks of brand-new Sunday Lunch episodes, Toyah and Robert Fripp are revisiting their cover of Hole “Celebrity Skin” where they made special posters for their cupboards: Celebrity Fripp a… [+183 chars]"
        },
        {
            "source": {
                "id": "politico",
                "name": "Politico"
            },
            "author": "By Ryan Biller",
            "title": "‘We Don’t Want to Be a National Laughingstock’: Why Lauren Boebert Had to Ditch Her District",
            "description": "The Colorado lawmaker’s decision to switch districts was a desperate act by a desperate candidate.",
            "url": "https://www.politico.com/news/magazine/2024/01/07/lauren-boebert-colorado-district-00134137",
            "urlToImage": "https://static.politico.com/d8/f5/8b3957cc48068c56d316b04c5174/https-delivery-gettyimages.com/downloads/1540353367",
            "publishedAt": "2024-01-07T12:00:00Z",
            "content": "I still blame Biden and the Democrats for the skyrocketing costs, Reid explained, but I got a weird sort of feeling when Boebert was ranting about masks because, by that point, masks were irrelevant … [+14682 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Forbes"
            },
            "author": "Gene Marks, Contributor, \n Gene Marks, Contributor\n https://www.forbes.com/sites/quickerbettertech/",
            "title": "Business Tech News Roundup: Microsoft Is Changing Your Keyboard",
            "description": "A new keyboard for Windows is coming, plus: Meta has a special advertising category and LinkedIn is raking in the ad dollars.",
            "url": "https://www.forbes.com/sites/quickerbettertech/2024/01/07/business-tech-news-roundup-microsoft-is-changing-your-keyboard/",
            "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/659804d2e51b7517e5e0d8e3/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
            "publishedAt": "2024-01-07T12:00:00Z",
            "content": "(Photo by Neil Godwin/PC Gamer Magazine/Future via Getty Images)\r\nPC Gamer Magazine/Future via Getty Images\r\nHere are five things in tech that happened this week and how they affect your business. Di… [+4566 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Vox"
            },
            "author": "Abdallah Fayyad",
            "title": "The shoplifting scare might not have been real — but its effects are",
            "description": "It turns out shoplifting isn’t spiraling out of control, but lawmakers are pushing for tougher penalties for low-level and nonviolent crimes anyway.",
            "url": "https://www.vox.com/politics/24025691/shoplifting-scare-criminal-justice-reform",
            "urlToImage": "https://cdn.vox-cdn.com/thumbor/MQFIAU3X-dFqHZPPq0psLxiqPmo=/0x286:4000x2380/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/25205477/1255750201.jpg",
            "publishedAt": "2024-01-07T12:00:00Z",
            "content": "New York City Mayor Eric Adams speaks during a press conference on reducing shoplifting. | Barry Williams/NY Daily News via Getty Images\r\n\n \n\n It turns out shoplifting isn’t spiraling out of control,… [+10238 chars]"
        },
        {
            "source": {
                "id": "cbc-news",
                "name": "CBC News"
            },
            "author": null,
            "title": "Which airline ranked the worst for being on time? Phone plans are going up: CBC's Marketplace cheat sheet",
            "description": "CBC's Marketplace rounds up the consumer and health news you need from the week.",
            "url": "https://www.cbc.ca/news/business/marketplace-cheat-sheet-jan05-1.7075830",
            "urlToImage": "https://i.cbc.ca/1.6982870.1696009825!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_620/air-canada-planes-20210428.jpg",
            "publishedAt": "2024-01-07T12:00:00Z",
            "content": "Miss something this week? Don't panic. CBC's Marketplace rounds up the consumer and health news you need.\r\nWant this in your inbox? Get the Marketplace newsletter every Friday.\r\nAir Canada lands last… [+5449 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "New York Post"
            },
            "author": "Fox News",
            "title": "US Navy veteran visits Florida cafe every day for breakfast, helps with tasks as staff plans birthday bash",
            "description": "Mr. Lee, as he is known, is a veteran who lives in Pensacola, Florida, and visits the Scenic 90 Cafe every morning for breakfast.",
            "url": "https://nypost.com/2024/01/07/lifestyle/us-navy-veteran-mr-lee-visits-florida-cafe-scenic-90-every-daay-for-breakfast/",
            "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2024/01/newspress-collage-79ma1eftr-1704627577384.jpg?quality=75&strip=all&1704609642&w=1024",
            "publishedAt": "2024-01-07T11:57:56Z",
            "content": "A US Navy veteran has touched thousands of hearts after a local café posted news of his loyalty to the restaurant. \r\nMr. Lee, as he is known, is a veteran who lives in Pensacola, Florida, and visits … [+4030 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Marketscreener.com"
            },
            "author": null,
            "title": "UK's Sunak: Government is looking at legal ways to help Post Office victims",
            "description": "(marketscreener.com) British Prime Minister Rishi Sunak said on Sunday his government was considering a move to exonerate hundreds of employees of the state-owned Post Office who were wrongfully convicted of false accounting, theft and fraud because of faulty…",
            "url": "https://www.marketscreener.com/news/latest/UK-s-Sunak-Government-is-looking-at-legal-ways-to-help-Post-Office-victims-45688096/",
            "urlToImage": "https://www.marketscreener.com/images/reuters/2024-01/2024-01-07T115717Z_1_LYNXMPEK06056_RTROPTP_3_BRITAIN-POLITICS-SUNAK.JPG",
            "publishedAt": "2024-01-07T11:57:17Z",
            "content": "LONDON (Reuters) - British Prime Minister Rishi Sunak said on Sunday his government was considering a move to exonerate hundreds of employees of the state-owned Post Office who were wrongfully convic… [+1082 chars]"
        },
        {
            "source": {
                "id": "the-times-of-india",
                "name": "The Times of India"
            },
            "author": "The Feed",
            "title": "The Golden Bachelor Wedding: Gerry Turner and Theresa Nist tie the knot, where to watch it on streaming",
            "description": "In a landmark moment, Gerry Turner and Theresa Nist, contestants on ABC's senior-aged spinoff \"The Golden Bachelor,\" have etched their names in history as the inaugural couple to tie the knot on the show. The momentous occasion, titled \"The Golden Wedding,\" w…",
            "url": "https://economictimes.indiatimes.com/news/international/us/the-golden-bachelor-wedding-gerry-turner-and-theresa-nist-tie-the-knot-where-to-watch-it-on-streaming/articleshow/106613921.cms",
            "urlToImage": "https://img.etimg.com/thumb/msid-106613962,width-1200,height-630,imgsize-160672,overlay-economictimes/photo.jpg",
            "publishedAt": "2024-01-07T11:57:17Z",
            "content": "(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.)\r\nDownload The Economic Times News App to get Daily International News… [+8 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Bleeding Cool News"
            },
            "author": "Rich Johnston",
            "title": "The Sinister Sons Get A Family To Fight For (Green Lantern Spoilers)",
            "description": "After Bleeding Cool ran a few teases, DC Comics confirmed a new Sinister Sons comic book series by Peter J. Tomasi and David LaFuente for February 2024, with Sinson and Lor-Zod, the sons of Sinestro and General Zod on their own mission. In Kneel Before Zod #1…",
            "url": "https://bleedingcool.com/comics/the-sinister-sons-get-a-family-to-fight-for-green-lantern-spoilers/",
            "urlToImage": "https://bleedingcool.com/wp-content/uploads/2024/01/1123DC115-2000x1125.jpg",
            "publishedAt": "2024-01-07T11:57:09Z",
            "content": "Posted in: Comics, Comics Publishers, Current News, DC Comics | Tagged: green lantern, Sinister Sons\r\nAfter Bleeding Cool ran teases, DC Comics confirmed a new Sinister Sons comic book series by Pete… [+3222 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "ETF Daily News"
            },
            "author": "MarketBeat News",
            "title": "Insider Selling: Semrush Holdings, Inc. (NASDAQ:SEMR) CEO Sells $37,071.31 in Stock",
            "description": "Semrush Holdings, Inc. (NASDAQ:SEMR – Get Free Report) CEO Oleg Shchegolev sold 2,903 shares of the firm’s stock in a transaction that occurred on Wednesday, January 3rd. The stock was sold at an average price of $12.77, for a total transaction of $37,071.31.…",
            "url": "https://www.etfdailynews.com/2024/01/07/insider-selling-semrush-holdings-inc-nasdaqsemr-ceo-sells-37071-31-in-stock/",
            "urlToImage": "https://www.americanbankingnews.com/wp-content/timthumb/timthumb.php?src=https://www.marketbeat.com/logos/semrush-holdings-inc-logo.png&w=240&h=240&zc=2",
            "publishedAt": "2024-01-07T11:56:41Z",
            "content": "Semrush Holdings, Inc. (NASDAQ:SEMR – Get Free Report) CEO Oleg Shchegolev sold 2,903 shares of the firm’s stock in a transaction that occurred on Wednesday, January 3rd. The stock was sold at an ave… [+5445 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "ETF Daily News"
            },
            "author": "MarketBeat News",
            "title": "Matthew R. Dobson Sells 2,643 Shares of Zuora, Inc. (NYSE:ZUO) Stock",
            "description": "Zuora, Inc. (NYSE:ZUO – Get Free Report) CAO Matthew R. Dobson sold 2,643 shares of the stock in a transaction on Thursday, January 4th. The stock was sold at an average price of $8.36, for a total value of $22,095.48. Following the completion of the transact…",
            "url": "https://www.etfdailynews.com/2024/01/07/matthew-r-dobson-sells-2643-shares-of-zuora-inc-nysezuo-stock/",
            "urlToImage": "https://www.americanbankingnews.com/wp-content/timthumb/timthumb.php?src=https://www.marketbeat.com/logos/zuora-inc-logo.jpg?v=20221206114024&w=240&h=240&zc=2",
            "publishedAt": "2024-01-07T11:56:41Z",
            "content": "Zuora, Inc. (NYSE:ZUO – Get Free Report) CAO Matthew R. Dobson sold 2,643 shares of the stock in a transaction on Thursday, January 4th. The stock was sold at an average price of $8.36, for a total v… [+3962 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Marketscreener.com"
            },
            "author": null,
            "title": "Fire leaves nearly 7,000 Rohingya homeless in Bangladesh camp",
            "description": "(marketscreener.com) A fire swept through a Rohingya refugee camp in southeastern Bangladesh in the early hours of Sunday, destroying about 800 shelters and rendering thousands homeless, officials said.https://www.marketscreener.com/quote/index/TOPIX-INDEX-61…",
            "url": "https://www.marketscreener.com/news/latest/Fire-leaves-nearly-7-000-Rohingya-homeless-in-Bangladesh-camp-45688095/",
            "urlToImage": "https://www.marketscreener.com/images/reuters/2024-01/2024-01-07T115558Z_1_LYNXMPEK06052_RTROPTP_3_BANGLADESH-ROHINGYA-FIRE.JPG",
            "publishedAt": "2024-01-07T11:55:58Z",
            "content": "DHAKA (Reuters) - A fire swept through a Rohingya refugee camp in southeastern Bangladesh in the early hours of Sunday, destroying about 800 shelters and rendering thousands homeless, officials said.… [+1692 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Kemifilani.ng"
            },
            "author": "Mercy Trin",
            "title": "\"It's another beautiful blessing\" Nadia Buari receives an outpour of love as she welcomes fifth child - Kemi Filani News",
            "description": "Ghanaian actress, Nadia Buari is starting this year as a mother of five, as she welcomes another child. The delectable movie star, who is married, via her Instagram page, shared a photo of her and her newborn, whose gender she kept hidden. In her caption, Nad…",
            "url": "https://www.kemifilani.ng/entertainment/nadia-buari-receives-an-outpour-of-love-as-she-welcomes-fifth-child/",
            "urlToImage": "https://www.kemifilani.ng/wp-content/uploads/2024/01/Another-beautiful-blessing-Nadia-Buari-welcomes-fifth-child-Kemi-Filani-blog-min.jpg",
            "publishedAt": "2024-01-07T11:55:24Z",
            "content": "Ghanaian actress, Nadia Buari is starting this year as a mother of five, as she welcomes another child.\r\nThe delectable movie star, who is married, via her Instagram page, shared a photo of her and h… [+2204 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "RaceFans"
            },
            "author": "Will Wood",
            "title": "2023 in polls: Your verdicts on Andretti, Red Bull domination, sprint races and more | Debates and polls",
            "description": "The 2023 season was one full of debates. As ever, RaceFans asked our readers for their views along the way. Here's how you responded.",
            "url": "https://www.racefans.net/2024/01/07/racefans-readers-verdicts-on-the-2023-f1-season-the-year-in-polls/",
            "urlToImage": "https://www.racefans.net/wp-content/uploads/2023/10/Sunday-at-US-GPSI202310220648_hires_jpeg_24bit_rgb.jpg",
            "publishedAt": "2024-01-07T11:55:16Z",
            "content": "A new year brings with it new questions, debates and unknowns about the upcoming season of Formula 1 racing that will follow.\r\nJust like any other year, throughout 2023 we canvassed RaceFans readers … [+9854 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Raw Story"
            },
            "author": "Sabrina Haake",
            "title": "Donald Trump’s un-American ploy for criminal immunity",
            "description": "On January 2, Donald Trump’s legal team filed his last official\r\n salvo with the Court of Appeals for the D.C. Circuit, continuing to argue\r\n that he is entitled to presidential immunity for plotting to overturn the 2020 election.His ploy for criminal immunit…",
            "url": "https://www.rawstory.com/raw-investigates/donald-trumps-un-american-ploy-for-criminal-immunity/",
            "urlToImage": "https://www.rawstory.com/media-library/image.jpg?id=51016374&width=1200&height=600&coordinates=0%2C82%2C0%2C232",
            "publishedAt": "2024-01-07T11:54:49Z",
            "content": "On January 2, Donald Trumps legal team filed his last official\r\n salvo with the Court of Appeals for the D.C. Circuit, continuing to argue\r\n that he is entitled to presidential immunity for plotting … [+11015 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "PEOPLE"
            },
            "author": "Escher Walcott",
            "title": "Taylor Swift, Brittany Mahomes Have Dinner in L.A. Ahead of Chiefs Game",
            "description": "Taylor Swift and Brittany Mahomes had a WAGS night out with friends at Spago restaurant in Beverly Hills on Saturday. The friends were 'super chill' during the dinner, an onlooker tells PEOPLE.",
            "url": "https://people.com/taylor-swift-brittany-mahomes-have-dinner-in-l-a-ahead-of-chiefs-game-8423229",
            "urlToImage": "https://people.com/thmb/dmkd1JgZZo5igVL2EZ59ZRHK9jM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(753x110:755x112)/taylor-swift-brittany-mahomes-092923-e3edb622f1b643a3941fb4e3678be01a.jpg",
            "publishedAt": "2024-01-07T11:54:04Z",
            "content": "Its ladies' night for Taylor Swift and Brittany Mahomes!\r\nOn Saturday, Swift, 34, and Brittany, who is the wife of Kansas City Chiefs quarterback Patrick Mahomes, headed out for dinner together at Sp… [+2784 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Securityaffairs.com"
            },
            "author": "Pierluigi Paganini",
            "title": "Security Affairs newsletter Round 453 by Pierluigi Paganini – INTERNATIONAL EDITION",
            "description": "A new round of the weekly SecurityAffairs newsletter arrived! Every week the best security articles from Security Affairs are free for you in your email box. Enjoy a new round of the weekly SecurityAffairs newsletter, including the international press. Expert…",
            "url": "https://securityaffairs.com/157039/breaking-news/security-affairs-newsletter-round-453-by-pierluigi-paganini-international-edition.html",
            "urlToImage": "https://securityaffairs.com/wp-content/uploads/2015/03/newsletter.png",
            "publishedAt": "2024-01-07T11:53:26Z",
            "content": "Security Affairs newsletter Round 453 by Pierluigi Paganini INTERNATIONAL EDITION\r\n | Turkish Sea Turtle APT targets Dutch IT and Telecom firms\r\n | Experts spotted a new macOS Backdoor named Spectral… [+34871 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Biztoc.com"
            },
            "author": "coinpedia.org",
            "title": "Bill Morgan Applauds Grayscale’s Strategic Move To Add XRP and AVAX to Digital Large Cap Fund",
            "description": "The post Bill Morgan Applauds Grayscale’s Strategic Move To Add XRP and AVAX to Digital Large Cap Fund appeared first on Coinpedia Fintech News On January 4, 2024, Grayscale Investments strategically reshaped its Digital Large Cap Fund portfolio, as revealed …",
            "url": "https://biztoc.com/x/38cee55476ed99ae",
            "urlToImage": "https://c.biztoc.com/265/og.png",
            "publishedAt": "2024-01-07T11:52:23Z",
            "content": "The post Bill Morgan Applauds Grayscales Strategic Move To Add XRP and AVAX to Digital Large Cap Fund appeared first on Coinpedia Fintech NewsOn January 4, 2024, Grayscale Investments strategically r… [+312 chars]"
        }
    ]
}