{
    "status": "ok",
    "totalResults": 230439,
    "articles": [
        {
            "source": {
                "id": "fox-news",
                "name": "Fox News"
            },
            "author": "Pilar Arias",
            "title": "Apalachee High School shooting victim Mason Schermerhorn sent last text to mom from restroom, chaplain says",
            "description": "One of the four killed in Wednesday's mass shooting at Apalachee High School in Georgia last texted his mother from inside a restroom, a chaplain said.",
            "url": "https://www.foxnews.com/us/apalachee-high-school-shooting-victim-mason-schermerhorn-sent-last-text-mom-from-restroom-chaplain-says",
            "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2024/09/mason-apalachee-featured.jpg",
            "publishedAt": "2024-09-05T18:27:27Z",
            "content": "Mason Schermerhorn last texted his mom from the restroom before he was discovered as one of the four killed in a mass shooting at Apalachee High School in Winder, Georgia, a chaplain and youth minist… [+2105 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Livemint"
            },
            "author": "list.metadata.agency",
            "title": "Oil Swings as OPEC Production Pause Vies With Risk-Off Mood",
            "description": "Oil fluctuated between gains and losses after risk-off sentiment in broader markets vied with an OPEC  agreement to pause its planned crude production increase for two months.",
            "url": "https://www.livemint.com/companies/news/oil-swings-as-opec-production-pause-vies-with-risk-off-mood-11725560828233.html",
            "urlToImage": "https://images.livemint.com/img/2018/12/28/1600x900/Companies_-_News_1545993790355.jpg",
            "publishedAt": "2024-09-05T18:27:07Z",
            "content": "(Bloomberg) -- Oil fluctuated between gains and losses after risk-off sentiment in broader markets vied with an OPEC agreement to pause its planned crude production increase for two months.  \r\n Globa… [+1546 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Mjtsai.com"
            },
            "author": "Michael Tsai",
            "title": "Founder Mode",
            "description": "Paul Graham (Hacker News): The theme of Brian’s talk was that the conventional wisdom about how to run larger companies is mistaken. As Airbnb grew, well-meaning people advised him that he had to run the company in a certain way for it to scale. Their advice …",
            "url": "https://mjtsai.com/blog/2024/09/05/founder-mode/",
            "urlToImage": null,
            "publishedAt": "2024-09-05T18:27:06Z",
            "content": "Paul Graham (Hacker News):\r\nThe theme of Brian’s talk was that the conventional wisdom about how to run larger companies is mistaken. As Airbnb grew, well-meaning people advised him that he had to ru… [+2232 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Investing.com"
            },
            "author": "Reuters",
            "title": "Exclusive-Vista and Blackstone in talks to acquire software maker Smartsheet, sources say",
            "description": "Exclusive-Vista and Blackstone in talks to acquire software maker Smartsheet, sources say",
            "url": "https://www.investing.com/news/stock-market-news/exclusivevista-and-blackstone-in-talks-to-acquire-software-maker-smartsheet-sources-say-3603780",
            "urlToImage": "https://i-invdn-com.investing.com/news/LYNXNPEC180BO_L.jpg",
            "publishedAt": "2024-09-05T18:26:50Z",
            "content": "By Milana Vinn\r\nNEW YORK (Reuters) - A private equity consortium including Vista Equity Partners and Blackstone (NYSE:BX) is in talks to acquire Smartsheet (NYSE:SMAR), a U.S. maker of workplace coll… [+2604 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Tech Xplore"
            },
            "author": "Michelle Chapman",
            "title": "Verizon is buying Frontier in $20B deal to strengthen its fiber network",
            "description": "Verizon is buying Frontier Communications in a $20 billion deal to strengthen its fiber network.",
            "url": "https://techxplore.com/news/2024-09-verizon-buying-frontier-20b-fiber.html",
            "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/verizon-is-buying-fron.jpg",
            "publishedAt": "2024-09-05T18:26:15Z",
            "content": "Verizon is buying Frontier Communications in a $20 billion deal to strengthen its fiber network.\r\nVerizon Communications Inc. said Thursday that the acquisition will also shore up its foray into arti… [+2603 chars]"
        },
        {
            "source": {
                "id": "rt",
                "name": "RT"
            },
            "author": "RT",
            "title": "Labor migrants should leave families at home – Medvedev",
            "description": "Former Russian President Dmitry Medvedev wants to further tighten the country’s migration laws Read Full Article at RT.com",
            "url": "https://www.rt.com/russia/603583-medvedev-labor-migrants-families/",
            "urlToImage": "https://mf.b37mrtl.ru/files/2024.09/article/66d9f53f85f54003f16322e0.jpg",
            "publishedAt": "2024-09-05T18:26:02Z",
            "content": "Former Russian President Dmitry Medvedev has floated a handful of ideas to tackle migration-related problems, including preventing seasonal workers from bringing their families into the country.\r\nMed… [+2315 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "9to5Toys"
            },
            "author": "Karthik Iyer",
            "title": "UGREEN’s brand new 40Gb/s metal M.2 SSD enclosure with cooling fan is down to $70 Amazon low",
            "description": "Courtesy of the official UGREEN storefront on Amazon, you can now score its 40Gb/s M.2 NVMe SSD Enclosure at $69.99 shipped with a 30% discount that applies at checkout. This brand-new SSD enclosure landed on Amazon just a few days ago carrying a $120 price t…",
            "url": "http://9to5toys.com/2024/09/05/ugreen-new-metal-m-2-ssd-enclosure-cooling-fan-down-70-amazon-low/",
            "urlToImage": "https://i0.wp.com/9to5toys.com/wp-content/uploads/sites/5/2024/09/UGREEN-40Gbps-ssd-enclosure.jpg?resize=1200%2C628&ssl=1",
            "publishedAt": "2024-09-05T18:25:50Z",
            "content": "Courtesy of the official UGREEN storefront on Amazon, you can now score its 40Gb/s M.2 NVMe SSD Enclosure at $69.99 shipped with a 30% discount that applies at checkout. This brand-new SSD enclosure … [+2702 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Tech Xplore"
            },
            "author": "Science X",
            "title": "Researchers develop hybrid laser technique to address copper oxidation issue",
            "description": "Prof. Kaichen Xu and his coworkers from Zhejiang University have developed a novel method to integrate sensor systems directly into engineering thermoplastics using laser technology. Their breakthrough offers the potential for improved safety and extended ser…",
            "url": "https://techxplore.com/news/2024-09-hybrid-laser-technique-copper-oxidation.html",
            "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/zju-researchers-addres.jpg",
            "publishedAt": "2024-09-05T18:25:16Z",
            "content": "Prof. Kaichen Xu and his coworkers from Zhejiang University have developed a novel method to integrate sensor systems directly into engineering thermoplastics using laser technology. Their breakthrou… [+3705 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Tech Xplore"
            },
            "author": "Science X",
            "title": "New neural framework enhances reconstruction of high-resolution images",
            "description": "Deep learning (DL) has significantly transformed the field of computational imaging, offering powerful solutions to enhance performance and address a variety of challenges. Traditional methods often rely on discrete pixel representations, which limit resoluti…",
            "url": "https://techxplore.com/news/2024-09-neural-framework-reconstruction-high-resolution.html",
            "urlToImage": "https://scx2.b-cdn.net/gfx/news/2024/new-neural-framework-e.jpg",
            "publishedAt": "2024-09-05T18:25:12Z",
            "content": "Deep learning (DL) has significantly transformed the field of computational imaging, offering powerful solutions to enhance performance and address a variety of challenges. Traditional methods often … [+3453 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "The New Republic"
            },
            "author": "Paige Oamek",
            "title": "MAGA Desperately Claims Russian Propagandists Were the Real “Victims”",
            "description": "MAGA Republicans are more than happy to excuse the right-wing influencers at the center of a Russian propaganda scheme. \r\nRight-wing influencers like Tim Pool, Dave Rubin, Lauren Southern, and Benny Johnson all worked with Tenet Media, a Tennessee-based firm …",
            "url": "https://newrepublic.com/post/185647/maga-russian-propagandists-victims-pool-johnson-rubin-tenet-media",
            "urlToImage": "https://images.newrepublic.com/60e8d1da7e4570590263ec4e1ecbb87686957596.jpeg?w=1200&h=630&crop=faces&fit=crop&fm=jpg",
            "publishedAt": "2024-09-05T18:24:49Z",
            "content": "Were not weird. Were other things, perhaps, but were not weird. But [Tim Walz] is a weird guy, he walks on the stage, theres something wrong with that guy, and he called me weird. And then the fake n… [+988 chars]"
        },
        {
            "source": {
                "id": "ars-technica",
                "name": "Ars Technica"
            },
            "author": "Samuel Axon",
            "title": "What to expect from Apple’s September 9 iPhone event",
            "description": "Here's what we already know about the new flagship iPhones.",
            "url": "https://arstechnica.com/gadgets/2024/09/what-to-expect-from-apples-september-9-iphone-event/",
            "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2024/09/Screenshot-2024-09-05-124054-760x380.png",
            "publishedAt": "2024-09-05T18:24:49Z",
            "content": "Enlarge/ Apple's event will likely discuss Apple Intelligence, though that's not going to launch until later in the year with iOS 18.1\r\n6\r\nFor years, Apple's September event has focused almost exclus… [+3872 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Rlsbb.cc"
            },
            "author": "saamaan1@yahoo.com (Master)",
            "title": "AgroSpectrum - September 2024",
            "description": "Agrospectrum is a B2B digital media platform catering to all sub-sectors and verticals of the agro business – from food grains to inputs, machinery, live-stock, fisheries to agro tourism. It regularly updates on latest news on Agri—business and analytical & i…",
            "url": "https://rlsbb.cc/agrospectrum-september-2024/",
            "urlToImage": null,
            "publishedAt": "2024-09-05T18:24:47Z",
            "content": "Agrospectrum is a B2B digital media platform catering to all sub-sectors and verticals of the agro business from food grains to inputs, machinery, live-stock, fisheries to agro tourism. It regularly … [+315 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Rlsbb.cc"
            },
            "author": "saamaan1@yahoo.com (Master)",
            "title": "Horse & Hound - 5 September 2024",
            "description": "The UK's leading weekly equestrian magazine. Every week Horse & Hound brings horse lovers up-to-date with the latest news and event reports and provides expert equestrian advice on subjects including training and horse care, the latest equine products and fee…",
            "url": "https://rlsbb.cc/horse-hound-5-september-2024/",
            "urlToImage": null,
            "publishedAt": "2024-09-05T18:24:47Z",
            "content": "The UK's leading weekly equestrian magazine. Every week Horse &amp; Hound brings horse lovers up-to-date with the latest news and event reports and provides expert equestrian advice on subjects inclu… [+443 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Rlsbb.cc"
            },
            "author": "saamaan1@yahoo.com (Master)",
            "title": "Art Collector - Sydney Contemporary 2024 Special Edition",
            "description": "Art Collector is a quarterly magazine covering contemporary Australian and Aboriginal art, and New Zealand art. Each issue profiles our top artists, collectors and dealers and is filled with informative articles on collecting as well as the latest art news.Ar…",
            "url": "https://rlsbb.cc/art-collector-sydney-contemporary-2024-special-edition/",
            "urlToImage": null,
            "publishedAt": "2024-09-05T18:24:47Z",
            "content": "Art Collector is a quarterly magazine covering contemporary Australian and Aboriginal art, and New Zealand art. Each issue profiles our top artists, collectors and dealers and is filled with informat… [+184 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Rlsbb.cc"
            },
            "author": "saamaan1@yahoo.com (Master)",
            "title": "Your Dog - October 2024",
            "description": "Your Dog is Britains best-selling, most-loved monthly dog publication and a subscription to the magazine is essential reading for any dog lover! Every issue of Your Dog is packed with information you need to keep your dog happy, healthy and entertained, with …",
            "url": "https://rlsbb.cc/your-dog-october-2024/",
            "urlToImage": null,
            "publishedAt": "2024-09-05T18:24:47Z",
            "content": "Your Dog is Britains best-selling, most-loved monthly dog publication and a subscription to the magazine is essential reading for any dog lover! Every issue of Your Dog is packed with information you… [+666 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Rlsbb.cc"
            },
            "author": "saamaan1@yahoo.com (Master)",
            "title": "Homebuilding & Renovating - October 2024",
            "description": "Homebuilding & Renovating is Britain’s best-selling magazine for a new or experienced individual creating a unique house through self-build, renovation, extension or conversion. Every issue contains expert advice on how to make your project a success, guide y…",
            "url": "https://rlsbb.cc/homebuilding-renovating-october-2024/",
            "urlToImage": null,
            "publishedAt": "2024-09-05T18:24:47Z",
            "content": "Homebuilding &amp; Renovating is Britains best-selling magazine for a new or experienced individual creating a unique house through self-build, renovation, extension or conversion. Every issue contai… [+370 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Rlsbb.cc"
            },
            "author": "saamaan1@yahoo.com (Master)",
            "title": "Elle UK - October 2024",
            "description": "Elle Magazine UK is an iconic womans monthly glossy magazine. It contains everything from fashion to beauty tips and the latest celebrity news. It is a mainstream magazine which is focused on bringing the reader important articles on related womens issues. It…",
            "url": "https://rlsbb.cc/elle-uk-october-2024/",
            "urlToImage": null,
            "publishedAt": "2024-09-05T18:24:47Z",
            "content": "Elle Magazine UK is an iconic womans monthly glossy magazine. It contains everything from fashion to beauty tips and the latest celebrity news. It is a mainstream magazine which is focused on bringin… [+327 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Rlsbb.cc"
            },
            "author": "saamaan1@yahoo.com (Master)",
            "title": "Edge - Issue 402, November 2024",
            "description": "Quite simply the leading name in games journalism, Edge magazine will be familiar to any true fan of cross-platform gaming. The wonderful thing about Edge is that, unlike pretty much every other gaming magazine out there, it is not tied into any one platform,…",
            "url": "https://rlsbb.cc/edge-issue-402-november-2024/",
            "urlToImage": null,
            "publishedAt": "2024-09-05T18:24:46Z",
            "content": "Quite simply the leading name in games journalism, Edge magazine will be familiar to any true fan of cross-platform gaming. The wonderful thing about Edge is that, unlike pretty much every other gami… [+519 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Biztoc.com"
            },
            "author": "news.google.com",
            "title": "‘There were blood puddles on the floor:’ CDC expects more people to get sick from Boar’s Head listeria outbreak",
            "description": "‘There were blood puddles on the floor:’ CDC expects more people to get sick from Boar’s Head listeria outbreak 29 NewsView Full Coverage on Google News",
            "url": "https://biztoc.com/x/09d25c2df7ee3cfd",
            "urlToImage": "https://biztoc.com/cdn/800/og.png",
            "publishedAt": "2024-09-05T18:24:43Z",
            "content": "There were blood puddles on the floor: CDC expects more people to get sick from Boars Head listeria outbreak 29 NewsView Full Coverage on Google News\r\nThis story appeared on news.google.com, 2024-09-… [+2 chars]"
        },
        {
            "source": {
                "id": "financial-post",
                "name": "Financial Post"
            },
            "author": "Business Wire",
            "title": "WEST ELM LAUNCHES NEW COLLABORATION WITH FASHION TASTEMAKER AND BEST-SELLING CHILDREN’S BOOK AUTHOR, EVA CHEN",
            "description": "The Colorful Collaboration is Inspired by Chen’s Family’s Love of Reading BROOKLYN, NY — Global design company, West Elm, a portfolio brand of Williams-Sonoma, Inc. (NYSE: WSM), the world’s largest digital-first, design-led and sustainable home retailer, anno…",
            "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/west-elm-launches-new-collaboration-with-fashion-tastemaker-and-best-selling-childrens-book-author-eva-chen",
            "urlToImage": "https://smartcdn.gprod.postmedia.digital/financialpost/wp-content/uploads/2024/09/bw20240904396484_pl-wek-x-eva-chen-x-bedroom-main-v01-336.jpeg",
            "publishedAt": "2024-09-05T18:24:39Z",
            "content": "The Colorful Collaboration is Inspired by Chens Familys Love of Reading\r\nBROOKLYN, NY Global design company, West Elm, a portfolio brand of Williams-Sonoma, Inc. (NYSE: WSM), the worlds largest digit… [+4499 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Biztoc.com"
            },
            "author": "zerohedge.com",
            "title": "Economist Jeffrey Sachs Reveals How Neocons Subverted Russia's Financial Stabilization In Early 1990s",
            "description": "Economist Jeffrey Sachs Reveals How Neocons Subverted Russia's Financial Stabilization In Early 1990s\n \nAuthored by Jeffrey Sachs and Matt Taibbi via Racket News,\nEditor’s note: thanks in large part to Ryan Grim, whose new “Drop Site” Substack can be found he…",
            "url": "https://biztoc.com/x/7199f040013031b5",
            "urlToImage": "https://biztoc.com/cdn/7199f040013031b5_s.webp",
            "publishedAt": "2024-09-05T18:24:32Z",
            "content": "Economist Jeffrey Sachs Reveals How Neocons Subverted Russia's Financial Stabilization In Early 1990s\r\nAuthored by Jeffrey Sachs and Matt Taibbi via Racket News,Editors note: thanks in large part to … [+127 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Android Central"
            },
            "author": "tips@androidcentral.com (Nickolas Diaz)",
            "title": "OnePlus 13 looks to continue using more eye-friendly BOE OLED panels",
            "description": "OnePlus President Li Jie confirmed that the company will continue to work with BOE and its displays for a new device.",
            "url": "https://www.androidcentral.com/phones/oneplus-13-eye-friendly-boe-panel-confirmed",
            "urlToImage": "https://cdn.mos.cms.futurecdn.net/Y4AyMuKB927SciXLKdbBcf-1200-80.jpg",
            "publishedAt": "2024-09-05T18:24:15Z",
            "content": "What you need to know\r\n<ul><li>OnePlus President Li Jie confirmed on Weibo that an upcoming unnamed device will utilize the new BOE X-series display.</li><li>Li Jie states this continued partnership … [+2682 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Investing.com"
            },
            "author": "Investing.com",
            "title": "Duke Energy Florida requests to lower rates in 2025",
            "description": "Duke Energy Florida requests to lower rates in 2025",
            "url": "https://www.investing.com/news/press-releases/duke-energy-florida-requests-to-lower-rates-in-2025-93CH-3603836",
            "urlToImage": "https://i-invdn-com.investing.com/redesign/images/seo/investing_300X300.png",
            "publishedAt": "2024-09-05T18:24:08Z",
            "content": "<ul><li>If approved, a 1,000 kWh residential customer bill will decrease by $9.77\r\n</li></ul>ST. PETERSBURG, Fla.\r\n, Sept. 5, 2024\r\n /PRNewswire/ -- Duke Energy (NYSE:DUK) Florida requested to lower … [+3326 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Livemint"
            },
            "author": "list.metadata.agency",
            "title": "Verizon’s $9.6 Billion Bid for Frontier Expands Broadband",
            "description": "Verizon Communications Inc., the largest US phone company, agreed to buy rival telecommunications operator Frontier Communications Parent Inc. for about $9.59 billion to expand its high-speed internet business.",
            "url": "https://www.livemint.com/companies/news/verizons-9-6-billion-bid-for-frontier-expands-broadband-11725560648080.html",
            "urlToImage": "https://images.livemint.com/img/2018/12/28/1600x900/Companies_-_News_1545993790355.jpg",
            "publishedAt": "2024-09-05T18:24:07Z",
            "content": "(Bloomberg) -- Verizon Communications Inc., the largest US phone company, agreed to buy rival telecommunications operator Frontier Communications Parent Inc. for about $9.59 billion to expand its hig… [+4117 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "TVLine"
            },
            "author": "Andy Swift",
            "title": "Zatima Season 3 Sets BET+ Premiere Date, Adds Sistas’ Trinity Whiteside to Cast — Watch Trailer",
            "description": "The undisputed king and queen of Tyler Perry Studios will be back to continue their reign next month. BET+ has set a Thursday, Oct. 3 premiere date for the third season of Sistas spinoff Zatima. This long-awaited news comes nearly a full calendar year after t…",
            "url": "https://tvline.com/news/zatima-season-3-release-date-bet-plus-trailer-video-1235326554/",
            "urlToImage": "https://tvline.com/wp-content/uploads/2024/09/zatima-season-3-release-date-trailer-bet-plus.jpg?w=650",
            "publishedAt": "2024-09-05T18:23:32Z",
            "content": "The undisputed king and queen of Tyler Perry Studios will be back to continue their reign next month. BET+ has set a Thursday, Oct. 3 premiere date for the third season of Sistas spinoff Zatima.\r\nThi… [+1152 chars]"
        },
        {
            "source": {
                "id": "fox-news",
                "name": "Fox News"
            },
            "author": "Kristine Parks",
            "title": "New York Republican wrangles with CNN host hitting Trump's economic policies",
            "description": "Rep. Mike Lawler, R-N.Y., debated CNN host Sara Sidner over Vice President Kamala Harris' economic policies and whether they would \"cripple\" the economy.",
            "url": "https://www.foxnews.com/media/new-york-republican-wrangles-cnn-host-hitting-trumps-economic-policies",
            "urlToImage": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/d78b2de7-a3c0-417a-b322-0d182e887028/4165dffa-83eb-4035-9c9a-f5203e2f1a03/1280x720/match/image.jpg",
            "publishedAt": "2024-09-05T18:23:28Z",
            "content": "Join Fox News for access to this content\r\nYou have reached your maximum number of articles. Log in or create an account FREE of charge to continue reading.\r\nBy entering your email and pushing continu… [+5257 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "CleanTechnica"
            },
            "author": "Derek Markham",
            "title": "Batteries Plus & Green Bay Packers Partner To Launch Battery Recycling Initiative",
            "description": "By leveraging the attention of Cheeseheads everywhere, a partnership between the Green Bay Packers and Batteries Plus may supply a big boost for the launch of a new battery recycling initiative backed by $7 million in DOE funding. The Green Bay Packers, with …",
            "url": "https://cleantechnica.com/2024/09/05/batteries-plus-green-bay-packers-partner-to-launch-battery-recycling-initiative/",
            "urlToImage": "https://cleantechnica.com/wp-content/uploads/2024/09/greenbaypackers-batteriesplus.webp",
            "publishedAt": "2024-09-05T18:23:19Z",
            "content": "Sign up for daily news updates from CleanTechnica on email. Or follow us on Google News!\r\nBy leveraging the attention of Cheeseheads everywhere, a partnership between the Green Bay Packers and Batter… [+3437 chars]"
        },
        {
            "source": {
                "id": "newsweek",
                "name": "Newsweek"
            },
            "author": "Erin Keller",
            "title": "Lawyer for 'The Ketamine Queen' Breaks Silence About Matthew Perry Case",
            "description": "Lawyer Mark Geragos tells Newsweek that his client 'Ketamine Queen' Jasveen Sangha has nothing to do with Matthew Perry's fatal overdose.",
            "url": "https://www.newsweek.com/matthew-perry-death-ketamine-lawyer-jasveen-sangha-update-1949286",
            "urlToImage": "https://d.newsweek.com/en/full/2465144/matthew-perry.jpg",
            "publishedAt": "2024-09-05T18:23:05Z",
            "content": "High-profile lawyer Mark Geragos says his client, \"The Ketamine Queen\" charged in Matthew Perry's fatal overdose, has nothing to do with the Friends star's death.\r\nAlleged drug dealer Jasveen Sangha,… [+3506 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "pymnts.com"
            },
            "author": "PYMNTS",
            "title": "CFPB Says Debt Collectors Using Illegal Tactics",
            "description": "The Consumer Financial Protection Bureau (CFPB) has found that debt collectors are using illegal tactics, and it is taking steps to ensure they follow consumer financial protection laws. The regulator said this in a Thursday (Sept. 5) press release announcing…",
            "url": "https://www.pymnts.com/news/cfpb/2024/cfpb-says-debt-collectors-using-illegal-tactics/",
            "urlToImage": "https://www.pymnts.com/wp-content/uploads/2023/12/CFPB-1.jpg",
            "publishedAt": "2024-09-05T18:23:03Z",
            "content": "The Consumer Financial Protection Bureau (CFPB) has found that debt collectors are using illegal tactics, and it is taking steps to ensure they follow consumer financial protection laws.\r\nThe regulat… [+2795 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Business Standard"
            },
            "author": "Press Trust of India",
            "title": "Allied Blenders, Ranveer Singh to start new venture in premium segment",
            "description": "Liquor maker Allied Blenders and Distillers has partnered with Bollywood star Ranveer Singh to start a new business venture to offer a portfolio of premium brands.",
            "url": "https://www.business-standard.com/companies/news/allied-blenders-ranveer-singh-to-start-new-venture-in-premium-segment-124090501274_1.html",
            "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2024-08/12/thumb/featurecrop/400X400/1723443959-2912.jpg",
            "publishedAt": "2024-09-05T18:22:15Z",
            "content": "With Indians drinking better and trending to luxury products, this business is set to make a significant impact\r\n(Company logo)\r\nPress Trust of IndiaNew Delhi\r\nLiquor maker Allied Blenders and Distil… [+1441 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Investing.com"
            },
            "author": "Investing.com",
            "title": "Keith Rosenbloom buys American Vanguard shares worth $790,844",
            "description": "Keith Rosenbloom buys American Vanguard shares worth $790,844",
            "url": "https://www.investing.com/news/company-news/keith-rosenbloom-buys-american-vanguard-shares-worth-790844-93CH-3603831",
            "urlToImage": "https://i-invdn-com.investing.com/redesign/images/seo/investing_300X300.png",
            "publishedAt": "2024-09-05T18:22:08Z",
            "content": "Keith Rosenbloom, through Cruiser Capital Advisors LLC, has made a substantial purchase of American Vanguard Corp (NYSE:AVD) shares, with a total value of $790,844. The transactions occurred over a s… [+4532 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Freerepublic.com"
            },
            "author": "College Fix",
            "title": "Harvard, Columbia, Penn top list of worst universities for free speech: student survey",
            "description": "For second consecutive year, Harvard bottom ranked school with score of 0.00 The top five worst universities for free speech also all happen to be mostly Ivy League institutions, according to a major new student survey released today by the Foundation for Ind…",
            "url": "https://freerepublic.com/focus/f-news/4262966/posts",
            "urlToImage": null,
            "publishedAt": "2024-09-05T18:22:01Z",
            "content": "Skip to comments.\r\nHarvard, Columbia, Penn top list of worst universities for free speech: student surveyCollege Fix ^\r\n | September 5, 2024\r\n | Janae Joachim\r\nPosted on 09/05/2024 11:22:01 AM PDT by… [+8871 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "BBC News"
            },
            "author": null,
            "title": "Scott Hastings' family 'heartbroken' as wife Jenny confirmed missing",
            "description": "Jenny Hastings \"struggled with her mental health for a number of years\", says family.",
            "url": "https://www.bbc.com/news/articles/ceq5ej0dex3o",
            "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/b7c3/live/4d497d30-6b8c-11ef-bfd9-5f2d264bba80.jpg",
            "publishedAt": "2024-09-05T18:21:59Z",
            "content": "Former Scotland rugby player Scott Hastings has confirmed his wife Jenny has been missing since disappearing at a wild swimming spot in the Firth of Forth on Tuesday.\r\nShe was reported missing in War… [+2133 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "[Removed]"
            },
            "author": null,
            "title": "[Removed]",
            "description": "[Removed]",
            "url": "https://removed.com",
            "urlToImage": null,
            "publishedAt": "1970-01-01T00:00:00Z",
            "content": "[Removed]"
        },
        {
            "source": {
                "id": "nbc-news",
                "name": "NBC News"
            },
            "author": "Rebecca Shabad and Ken Dilanian",
            "title": "DOJ charges Russia-backed TV network contributor with violating U.S. sanctions and money laundering",
            "description": "The Department of Justice has charged a contributor to Channel One Russia, a Russian state-run TV channel, and his wife with violating U.S. sanctions and money laundering.",
            "url": "https://www.nbcnews.com/politics/justice-department/doj-charges-russia-backed-tv-network-contributor-violating-us-sanction-rcna169775",
            "urlToImage": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-08/240829-DOJ-aa-1043a-e92c1c.jpg",
            "publishedAt": "2024-09-05T18:21:35Z",
            "content": "WASHINGTON The Department of Justice has charged a contributor to Channel One Russia, a Russian state-run TV channel, and his wife with violating U.S. sanctions and money laundering. \r\nThe indictment… [+2937 chars]"
        },
        {
            "source": {
                "id": "breitbart-news",
                "name": "Breitbart News"
            },
            "author": "Amy Furr, Amy Furr",
            "title": "Report: Virginia's Republican Lt. Gov. Winsome Earle-Sears Files to Run for Governor",
            "description": "The conservative Republican lieutenant governor of Virginia, Winsome Earle-Sears, is reportedly planning to run for governor in 2025.\nThe post Report: Virginia’s Republican Lt. Gov. Winsome Earle-Sears Files to Run for Governor appeared first on Breitbart.",
            "url": "https://www.breitbart.com/politics/2024/09/05/report-virginias-republican-lt-gov-winsome-earle-sears-files-run-governor/",
            "urlToImage": "https://media.breitbart.com/media/2024/09/Winsome-Earle-Sears-640x335.jpg",
            "publishedAt": "2024-09-05T18:21:31Z",
            "content": "The conservative Republican lieutenant governor of Virginia, Winsome Earle-Sears, is planning to run for governor in 2025.\r\nVirginia governors are limited to one term, so Gov. Glen Youngkin will not … [+2052 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Yahoo Entertainment"
            },
            "author": "Usman Kabir",
            "title": "Dell Technologies Inc. (DELL): An AI Stock You Should Not Have Missed",
            "description": "We recently compiled a list of the AI News You Should Not Have Missed. In this article, we are going to take a look at where Dell Technologies Inc...",
            "url": "https://finance.yahoo.com/news/dell-technologies-inc-dell-ai-182110193.html",
            "urlToImage": "https://s.yimg.com/ny/api/res/1.2/l_VPIbo3eSaIedAlaBtGtQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzM-/https://media.zenfs.com/en/insidermonkey.com/3ce896db267814e242ffb81416b4ea6f",
            "publishedAt": "2024-09-05T18:21:10Z",
            "content": "We recently compiled a list of the AI News You Should Not Have Missed. In this article, we are going to take a look at where Dell Technologies Inc. (NYSE:DELL) stands against the other AI stocks.\r\nAr… [+5422 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Tech Xplore"
            },
            "author": "Science X",
            "title": "Meta-analysis paves the way for safer batteries with reduced fire and toxicity risks",
            "description": "Li-ion batteries can present major hazards, with the notion of safety based on narrow criteria. A meta-analysis of thermal runaway gas emissions by Sheffield researchers, published in the Journal of Energy Storage improves understanding and highlights the nee…",
            "url": "https://techxplore.com/news/2024-09-meta-analysis-paves-safer-batteries.html",
            "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/new-research-paves-the-2.jpg",
            "publishedAt": "2024-09-05T18:21:04Z",
            "content": "Li-ion batteries can present major hazards, with the notion of safety based on narrow criteria. A meta-analysis of thermal runaway gas emissions by Sheffield researchers, published in the Journal of … [+4893 chars]"
        },
        {
            "source": {
                "id": "newsweek",
                "name": "Newsweek"
            },
            "author": "Matt Levine",
            "title": "Bengals Star Ja'Marr Chase Hints at Week 1 Status With Thursday Practice Decision",
            "description": "Bengals star wideout Ja'Marr Chase may have given a clue on his status for Week 1 on Thursday.",
            "url": "https://www.newsweek.com/sports/nfl/bengals-star-jamarr-chase-hints-week-1-status-thursday-practice-decision-1949517",
            "urlToImage": "https://d.newsweek.com/en/full/2465319/jamarr-chase.jpg",
            "publishedAt": "2024-09-05T18:20:55Z",
            "content": "Just a few days before the Cincinnati Bengals' season opener against the New England Patriots, star wide receiver Ja'Marr Chase was seen practicing for the second straight day. He has been dealing wi… [+3078 chars]"
        },
        {
            "source": {
                "id": "cnn",
                "name": "CNN"
            },
            "author": "Liam Reilly",
            "title": "New York Times publisher A.G. Sulzberger sounds the alarm on Trump using authoritarian anti-press ‘playbook’ | CNN Business",
            "description": "A.G. Sulzberger, the New York Times publisher, sounded the alarm Thursday on the “quiet war” against press freedoms unleashed by authoritarians around the world and said Americans should understand the anti-media “playbook” that Donald Trump might employ in a…",
            "url": "https://www.cnn.com/2024/09/05/media/new-york-times-a-g-sulzberger-authoritarian-playbook-trump/index.html",
            "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-1323578581-copy.jpg?c=16x9&q=w_800,c_fill",
            "publishedAt": "2024-09-05T18:20:47Z",
            "content": "A.G. Sulzberger, the New York Times publisher, sounded the alarm Thursday on the quiet war against press freedoms unleashed by authoritarians around the world and said Americans should understand the… [+3177 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Daily Beast"
            },
            "author": "Eboni Boykin-Patterson",
            "title": "Whoopi Goldberg Slams ABC—and ICE—for Allowing Anna Delvey on ‘DWTS’",
            "description": "ABC/Gotham/GC Images\r\nWhoopi Goldberg is not happy about her employer ABC’s decision to cast convicted con artist Anna Delvey on the upcoming season of Dancing With the Stars.“I think back to all the families who’ve had family members arrested by ICE who have…",
            "url": "https://www.thedailybeast.com/whoopi-goldberg-slams-abcand-icefor-allowing-anna-delvey-on-dwts",
            "urlToImage": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1680,w_2987,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1725560371/Blank_3000_x_1680_troclv",
            "publishedAt": "2024-09-05T18:20:21Z",
            "content": "Whoopi Goldberg is not happy about her employer ABCs decision to cast convicted con artist Anna Delvey on the upcoming season of Dancing With the Stars.\r\nI think back to all the families whove had fa… [+2568 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "[Removed]"
            },
            "author": null,
            "title": "[Removed]",
            "description": "[Removed]",
            "url": "https://removed.com",
            "urlToImage": null,
            "publishedAt": "1970-01-01T00:00:00Z",
            "content": "[Removed]"
        },
        {
            "source": {
                "id": null,
                "name": "Memeorandum.com"
            },
            "author": null,
            "title": "6 takeaways as Trump attorneys, Chutkan spar over Jan. 6 case's future (The Hill)",
            "description": "The Hill:\n6 takeaways as Trump attorneys, Chutkan spar over Jan. 6 case's future  —  Former President Trump's attorneys on Thursday sparred with a federal judge about how his federal Jan. 6 criminal prosecution should move forward.  —  For months, Trump's pro…",
            "url": "https://www.memeorandum.com/240905/p69",
            "urlToImage": "https://thehill.com/wp-content/uploads/sites/2/2024/09/Jack-Smith-Donald-Trump-09.05.png?w=1280",
            "publishedAt": "2024-09-05T18:20:01Z",
            "content": "memeorandum is an auto-generated summary of the stories that US political commentators are discussing online right now.\r\nUnlike sister sites Techmeme and Mediagazer, it is not a human-edited news out… [+72 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Singletracks.com"
            },
            "author": "Greg Heil",
            "title": "After a 4-year review, Salida’s best flow trail has been protected from a gravel pit expansion",
            "description": "The Solstice flow trail in Salida, Colorado, was threatened by a gravel pit expansion. Following a four-year-long review by the Bureau of Land Management, this popular trail is now protected.\nThe article After a 4-year review, Salida’s best flow trail has bee…",
            "url": "https://www.singletracks.com/mtb-trails/after-a-4-year-review-salidas-best-flow-trail-has-been-protected-from-a-gravel-pit-expansion/",
            "urlToImage": "https://images.singletracks.com/blog/wp-content/uploads/2024/09/EQCG1178-1170x890.jpeg",
            "publishedAt": "2024-09-05T18:20:00Z",
            "content": "Photo: Greg Heil\r\nIt’s so satisfying when mountain bike advocacy work pays off! After an extensive four-year-long review by the Bureau of Land Management (BLM), the Solstice flow trail in Salida, CO,… [+1840 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "[Removed]"
            },
            "author": null,
            "title": "[Removed]",
            "description": "[Removed]",
            "url": "https://removed.com",
            "urlToImage": null,
            "publishedAt": "1970-01-01T00:00:00Z",
            "content": "[Removed]"
        },
        {
            "source": {
                "id": null,
                "name": "New Zealand Herald"
            },
            "author": "Julia Gabel",
            "title": "Kīngi Tūheitia tangi in photos: The day the helm of the Māori monarchy passed from father to daughter",
            "description": "Tūheitia was laid to rest at Taupiri Maunga on Thursday afternoon.",
            "url": "https://www.nzherald.co.nz/nz/politics/kingi-tuheitia-tangi-in-photos-the-day-the-helm-of-the-maori-monarchy-passed-from-father-to-daughter/MW7PMRDPHVCCHPVU4453STBG6U/",
            "urlToImage": "https://www.nzherald.co.nz/resizer/v2/R2EUJVBKQ5C2ZMG3WEQ4GE4HPM.jpg?auth=2cb687fc16c264358ed0225748f7373df69170b6f3532f68fcf53f269eb64ffd&width=1200&height=675&quality=70&smart=true",
            "publishedAt": "2024-09-05T18:19:14Z",
            "content": "When the anointment was complete, a procession to the Taupiri Maunga began, including a flotilla of waka, and hundreds of people including revered rangatira, rangatahi, babies and families.\r\nThere wa… [+3084 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Phys.Org"
            },
            "author": "Science X",
            "title": "Examining climate justice in urban public space adaptation",
            "description": "Evaluating processes and outcomes of climate change adaptation enables learning to facilitate climate-resilient pathways and prevent potentially unjust outcomes. A new study by Vanesa Castán Broto and her colleagues focuses on adaptation interventions in the …",
            "url": "https://phys.org/news/2024-09-climate-justice-urban-space.html",
            "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/climate-justice.jpg",
            "publishedAt": "2024-09-05T18:19:02Z",
            "content": "Evaluating processes and outcomes of climate change adaptation enables learning to facilitate climate-resilient pathways and prevent potentially unjust outcomes. A new study by Vanesa Castán Broto an… [+2377 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Thefly.com"
            },
            "author": null,
            "title": "Planet Labs PBC options imply 17.8% move in share price post-earnings",
            "description": "See the rest of the story here.\n\nthefly.com provides the latest financial news as it breaks. Known as a leader in market intelligence, The Fly's real-time, streaming news feed keeps individual investors, professional money managers, active traders, and corpor…",
            "url": "https://thefly.com/permalinks/entry.php/id3979332/PL-Planet-Labs-PBC-options-imply--move-in-share-price-postearnings",
            "urlToImage": "https://thefly.com/images/meta/options.jpg",
            "publishedAt": "2024-09-05T18:19:02Z",
            "content": "Earnings calls, analyst events, roadshows and more"
        },
        {
            "source": {
                "id": null,
                "name": "Newser"
            },
            "author": "Rob Quinn",
            "title": "He's Never Lived in Alaska. He's in Prison, and He's on the Ballot",
            "description": "Eric Hafner has never been an Alaska resident—and since he's serving a 20-year sentence in a federal prison thousands of miles away, he's unlikely to become one anytime soon. But he's still set to appear on the ballot for the state's only US House seat in Nov…",
            "url": "https://www.newser.com/story/355721/hes-never-lived-in-alaska-hes-in-prison-and-hes-on-the-ballot.html",
            "urlToImage": "https://img1-azrcdn.newser.com/image/1557570-12-20240905133117.jpeg",
            "publishedAt": "2024-09-05T18:18:00Z",
            "content": "Eric Hafner has never been an Alaska resident—and since he's serving a 20-year sentence in a federal prison thousands of miles away, he's unlikely to become one anytime soon. But he's still set to ap… [+751 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Yahoo Entertainment"
            },
            "author": "The Hockey News - Toronto Maple Leafs",
            "title": "Why the Maple Leafs Signed Defenseman Marshall Rifai to a Two-Year Extension",
            "description": "Rifai is entering the second year of a similar deal — a two-year, two-way contract with an AAV of $775,000 — he signed in July 2023.",
            "url": "https://sports.yahoo.com/why-maple-leafs-signed-defenseman-181752587.html",
            "urlToImage": "https://media.zenfs.com/en/the_hockey_news_toronto_maple_leafs_articles_721/9614e689b2a696c20e532e179724b828",
            "publishedAt": "2024-09-05T18:17:52Z",
            "content": "Marshall Rifai will be sticking around in the Maple Leafs organization for the foreseeable future.\r\nView the original article to see embedded media.\r\nThe Maple Leafs announced on Thursday afternoon t… [+2662 chars]"
        },
        {
            "source": {
                "id": "breitbart-news",
                "name": "Breitbart News"
            },
            "author": "Alana Mastrangelo, Alana Mastrangelo",
            "title": "Sam Smith, Jayne County, Andre 3000 Other Pop Stars Team Up for Transgender Propaganda Album",
            "description": "Singers Sam Smith, Sade Adu, André 3000, and Jayne County are collaborating on a 46-track transgender propaganda album titled \"Transa.\"\nThe post Sam Smith, Jayne County, André 3000 Other Pop Stars Team Up for Transgender Propaganda Album appeared first on Bre…",
            "url": "https://www.breitbart.com/entertainment/2024/09/05/sam-smith-jayne-county-andre-3000-other-pop-stars-team-up-for-transgender-propaganda-album/",
            "urlToImage": "https://media.breitbart.com/media/2024/09/samsmithcounty3000-640x335.jpg",
            "publishedAt": "2024-09-05T18:17:39Z",
            "content": "Singers Sam Smith, Sade Adu, André 3000, and Jayne County are collaborating on a 46-track transgender propaganda album titled “Transa.”\r\nThe album includes a track called “Young Lion,” in which Adu s… [+1795 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "New York Post"
            },
            "author": "Thomas Barrabi",
            "title": "Meta Oversight Board members have blasted Israel over Gaza: ‘Most criminal army in history’",
            "description": "At least four members of the Oversight Board – which sparked outrage by determining the anti-Israel phrase “from the river to the sea” doesn’t constitute hate speech – have published views critical of Israel’s toward Palestinians in Gaza.",
            "url": "https://nypost.com/2024/09/05/business/meta-oversight-board-members-have-blasted-israel-over-gaza/",
            "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2024/09/yemen-leymah-gbowee-liberia-jody-88996153.jpg?quality=75&strip=all&w=1024",
            "publishedAt": "2024-09-05T18:17:32Z",
            "content": "Multiple members of Facebook parent Metas Oversight Board have exhibited a clear anti-Israel bias since the war with Hamas began last Oct. 7 with one even referring to Israel as a terrorist governmen… [+6111 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Premium Times"
            },
            "author": "Beloved John",
            "title": "Despite calls for MDAs harmonisation, Nigerian govt set to establish health facilities regulatory body",
            "description": "The new development may have called to question the commitment of the Tinubu-led administration to carry out the much-touted harmonisation of the MDAs as announced earlier in the year.",
            "url": "https://www.premiumtimesng.com/news/top-news/731587-despite-calls-for-mdas-harmonisation-nigerian-govt-set-to-establish-health-facilities-regulatory-body.html",
            "urlToImage": "https://media.premiumtimesng.com/wp-content/files/2024/08/FyGfwu-XwAAJJTY.jpg",
            "publishedAt": "2024-09-05T18:17:18Z",
            "content": "The Nigerian government is set to establish another agency to be responsible for the regulation of healthcare facilities in the country.\r\nThis is in defiance of the recent directive by President Bola… [+1765 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Cosmopolitan.com"
            },
            "author": "Olivia Truffaut-Wong",
            "title": "Here's Everything We Know About ‘Tell Me Lies’ Season 3",
            "description": "Want more 'Tell Me Lies'? Here's everything we know about the Hulu show's potential season 3, including returning cast and when fans can expect new episodes.",
            "url": "https://www.cosmopolitan.com/entertainment/tv/a62006943/tell-me-lies-season-3-news-cast-details/",
            "urlToImage": "https://hips.hearstapps.com/hmg-prod/images/171454-1270-v1-66d9f535dceab.jpg?crop=1.00xw:0.752xh;0,0.0553xh&resize=1200:*",
            "publishedAt": "2024-09-05T18:17:00Z",
            "content": "In the twisted lives of the students/alumni at Baird College, there's always more to the story. And, TBH, it's my favorite story on television right now. As Tell Me Lies returns for a season 2, I'm a… [+2325 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "NBCSports.com"
            },
            "author": "Myles Simmons",
            "title": "Amari Cooper on previous trade rumors: It’s neither here nor there",
            "description": "Before Brandon Aiyuk signed his extension with the 49ers, he was involved in several trade rumors — one of which included the Browns and receiver Amari Cooper.",
            "url": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/amari-cooper-on-previous-trade-rumors-its-neither-here-nor-there",
            "urlToImage": "https://nbcsports.brightspotcdn.com/dims4/default/45ae1ed/2147483647/strip/true/crop/5400x3038+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fnbc-sports-production-nbc-sports.s3.us-east-1.amazonaws.com%2Fbrightspot%2F15%2Fe4%2Ff863c11a4843a279eadd39463de0%2Fhttps-delivery-gettyimages.com%2Fdownloads%2F2165439894",
            "publishedAt": "2024-09-05T18:16:36Z",
            "content": "Before Brandon Aiyuk signed his extension with the 49ers, he was involved in several trade rumors one of which included the Browns and receiver Amari Cooper. \r\nAround the time that reporting came out… [+1910 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Niemanlab.org"
            },
            "author": "Sarah Scire",
            "title": "The Institute for Nonprofit News rejected more than half of newsrooms that applied for membership in 2023",
            "description": "Here’s a nugget from the Institute for Nonprofit News that might come up as we creep ever closer to the 2024 elections. Only 48% of nonprofit newsrooms that applied for INN membership in 2023 were accepted. Others failed to meet INN membership standards, whic…",
            "url": "https://www.niemanlab.org/2024/09/the-institute-for-nonprofit-news-rejected-more-than-half-of-newsrooms-that-applied-for-membership-in-2023/",
            "urlToImage": "",
            "publishedAt": "2024-09-05T18:16:27Z",
            "content": "CLOSE\r\nMLA\r\nScire, Sarah. \"The Institute for Nonprofit News rejected more than half of newsrooms that applied for membership in 2023.\" Nieman Journalism Lab. Nieman Foundation for Journalism at Harva… [+1166 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "CinemaBlend"
            },
            "author": "Riley Utley",
            "title": "Another Network Series Is Ending, But Honestly, I Saw This One Coming",
            "description": "Is it a bummer, yes. Is it surprising, no.",
            "url": "https://www.cinemablend.com/television/9-1-1-lone-star-ending-saw-this-coming",
            "urlToImage": "https://cdn.mos.cms.futurecdn.net/qqGuoFBj4mkpgZPjtX8RLS-1200-80.jpg",
            "publishedAt": "2024-09-05T18:16:27Z",
            "content": "Well, after a lot of speculation, it's been confirmed that 9-1-1: Lone Star is coming to an end with Season 5. While it's a bummer that the upcoming fifth season, which is set to air on the 2024 TV s… [+1144 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Hollywood Life"
            },
            "author": "Jessica Acosta",
            "title": "Adele Gets Back For ‘Years of Putting Up With The Tabloids’ With Her Own Newspaper",
            "description": "Adele gets back at the tabloids by creating her own newspaper, featuring stories about moments from her shows in Munich, Germany.",
            "url": "https://hollywoodlife.com/2024/09/05/adele-gets-back-for-years-of-putting-up-with-the-tabloids-with-her-own-newspaper/",
            "urlToImage": "https://hollywoodlife.com/wp-content/uploads/2024/09/GettyImages-2165151244_669aa7-e1725560175465.jpg?fit=5472%2C3091",
            "publishedAt": "2024-09-05T18:16:26Z",
            "content": "Image Credit: Getty Images for AD\r\nAdele is not going easy on the tabloids she created her own newspaper to get back at them. The 36-year-old singer took to Instagram to share the playful newspaper s… [+1912 chars]"
        },
        {
            "source": {
                "id": "cbs-news",
                "name": "CBS News"
            },
            "author": "CBS News",
            "title": "Trump pleads not guilty in election interference case, judge's trial schedule coming",
            "description": "Former President Donald Trump pleaded not guilty to charges outlined in a new indictment for the election interference case before U.S. District Judge Tanya Chutkan. CBS News campaign reporter Katrina Kaufman has the latest.",
            "url": "https://www.cbsnews.com/video/trump-enters-plea-in-election-interference-case-judges-trial-schedule-coming/",
            "urlToImage": "https://assets2.cbsnewsstatic.com/hub/i/r/2024/09/05/ce169576-32d0-4e79-8fd3-0227b1fe09b8/thumbnail/1200x630/986223717f3289c9d68df9143bb61292/cbsn-fusion-trump-enters-plea-in-election-interference-case-judges-trial-schedule-coming-thumbnail.jpg?v=631cf5f2b4e8db7f9bc428589402864d",
            "publishedAt": "2024-09-05T18:16:00Z",
            "content": "Watch CBS News\r\nCopyright ©2024 CBS Interactive Inc. All rights reserved.\r\nGet browser notifications for breaking news, live events, and exclusive reporting.\r\nNot NowTurn On"
        },
        {
            "source": {
                "id": null,
                "name": "The Daily Caller"
            },
            "author": "Ilan Hulkower",
            "title": "Texas Officials Shut Down School After Water Supply Becomes Toxic, Blame Local Firefighters",
            "description": "Texas's Grand Prairie Independent School District (ISP) announced the closure of schools after the city found that their water supply was toxic.",
            "url": "https://dailycaller.com/2024/09/05/texas-grand-prairie-city-shut-down-school-water-supply-toxic-blame-firefighters/",
            "urlToImage": "https://cdn01.dailycaller.com/wp-content/uploads/2024/09/Elegant-Marbled-Branch-Pattern-Porcelain-Sink-with-Chrome-Fixtures-e1725559175369.jpg",
            "publishedAt": "2024-09-05T18:15:53Z",
            "content": "Readers,\r\nInstead of sucking up to the political and corporate powers that dominate America, The Daily Caller is fighting for you our readers. We humbly ask you to consider joining us in this fight.\r… [+3541 chars]"
        },
        {
            "source": {
                "id": "the-verge",
                "name": "The Verge"
            },
            "author": "Jess Weatherbed",
            "title": "YouTube is making new tools to protect creators from AI copycats",
            "description": "YouTube is developing new tools that aim to give creators on the platform more control over content that copies their voice or likeness using generative AI.",
            "url": "https://www.theverge.com/2024/9/5/24236841/youtube-ai-detection-tools-creators-singing-deepfakes",
            "urlToImage": "https://cdn.vox-cdn.com/thumbor/ubyA2LZNKLf2r_hol_pRIYx5P28=/0x0:2040x1360/1200x628/filters:focal(1020x680:1021x681)/cdn.vox-cdn.com/uploads/chorus_asset/file/23986637/acastro_STK092_01.jpg",
            "publishedAt": "2024-09-05T18:15:44Z",
            "content": "YouTube is making new tools to protect creators from AI copycats\r\nYouTube is making new tools to protect creators from AI copycats\r\n / The platform is developing separate tools for identifying conten… [+2821 chars]"
        },
        {
            "source": {
                "id": "the-times-of-india",
                "name": "The Times of India"
            },
            "author": "The Feed",
            "title": "Sunny Season 2: Will the Apple TV+ series release or is it cancelled?",
            "description": "Apple TV+'s original series Sunny, wrapped up with its finale, titled \"The Dark Manual,\" which aired on September 4.",
            "url": "https://economictimes.indiatimes.com/news/international/us/sunny-season-2-will-the-apple-tv-series-release-or-is-it-cancelled/articleshow/113103926.cms",
            "urlToImage": "https://img.etimg.com/thumb/msid-113103956,width-1200,height-630,imgsize-3686,overlay-economictimes/photo.jpg",
            "publishedAt": "2024-09-05T18:15:41Z",
            "content": "Apple TV+ has left fans of Sunny, the gripping thriller based on Colin OSullivans novel The Dark Manual, eagerly awaiting news on the future of the series. After the finale of Season 1, which aired o… [+3116 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Freerepublic.com"
            },
            "author": "Breitbart",
            "title": "Cuban: Kamala’s Capital Gains Tax Plan Would ‘Kill the Stock Market’",
            "description": "Billionaire investor Mark Cuban warned Thursday on CNBC’s “Squawk Box” that Vice President Kamala Harris’ capital gains tax plan would “kill the stock market.” Cuban said, “What I told them is if you tax unrealized gains, you’re going to kill the stock market…",
            "url": "https://freerepublic.com/focus/f-news/4262964/posts",
            "urlToImage": null,
            "publishedAt": "2024-09-05T18:15:32Z",
            "content": "Skip to comments.\r\nCuban: Kamalas Capital Gains Tax Plan Would Kill the Stock MarketBreitbart ^\r\n | 09/05/2024\r\n | Pam Key\r\nPosted on 09/05/2024 11:15:32 AM PDT by ChicagoConservative27\r\nBillionaire … [+6550 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "STLtoday.com"
            },
            "author": "By Nassim Benchaabane St. Louis Post-Dispatch",
            "title": "Drivers cut through Ferguson at up to 80 mph. The city hopes speed humps will slow them down.",
            "description": "The project in Ferguson, which has a population of about 18,300 people, is the latest effort to address speeding in north St. Louis County.",
            "url": "https://www.stltoday.com/news/local/metro/drivers-cut-through-ferguson-at-up-to-80-mph-the-city-hopes-speed-humps-will/article_1da31616-6a44-11ef-9632-af8c1b00bb25.html",
            "urlToImage": "https://bloximages.newyork1.vip.townnews.com/stltoday.com/content/tncms/assets/v3/editorial/9/82/98286c6c-6995-5a9a-9f23-216202a5a5d4/66d9db7931402.image.jpg?crop=1763%2C926%2C0%2C124&resize=1200%2C630&order=crop%2Cresize",
            "publishedAt": "2024-09-05T18:15:00Z",
            "content": "FERGUSON  The City of Ferguson is installing more than 100 speed humps on dozens of residential streets to try to curb speeding by locals and motorists who cut through the suburb from county roads an… [+3350 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Digital Journal"
            },
            "author": "AFP",
            "title": "Pernod can PSG sponsorship deal after Marseille protests",
            "description": "French drinks firm Pernod Ricard said Thursday it has scrapped a proposed sponsorship deal with soccer giants Paris Saint Germain after fans of bitter rivals Marseille threatened a boycott. Days after news of the tie-up surfaced, furious Marseille fans protes…",
            "url": "https://www.digitaljournal.com/world/pernod-can-psg-sponsorship-deal-after-marseille-protests/article",
            "urlToImage": "https://www.digitaljournal.com/wp-content/uploads/2024/09/8d3e2aa2b3469e5f57476d72e897eef438bb16b0.jpg",
            "publishedAt": "2024-09-05T18:14:59Z",
            "content": "A glass of pastis is as much associated with Marseille as the port city's Notre Dame basilica - Copyright AFP/File Frederic J. BROWN, Brendan SMIALOWSKI\r\nFrench drinks firm Pernod Ricard said Thursda… [+1721 chars]"
        },
        {
            "source": {
                "id": "financial-post",
                "name": "Financial Post"
            },
            "author": "Business Wire",
            "title": "Connors Bros. Announces Workforce Reductions at New Brunswick Operation",
            "description": "Downsizing follows government’s decision to reduce fishing quota by 24% in the Bay of Fundy BLACKS HARBOUR, New Brunswick — Connors Bros., North America’s leading supplier of canned herring, today announced the layoff of over 20% of the positions at its plant…",
            "url": "https://financialpost.com/pmn/business-wire-news-releases-pmn/connors-bros-announces-workforce-reductions-at-new-brunswick-operation",
            "urlToImage": null,
            "publishedAt": "2024-09-05T18:14:23Z",
            "content": "Downsizing follows governments decision to reduce fishing quota by 24% in the Bay of Fundy\r\nBLACKS HARBOUR, New Brunswick Connors Bros., North Americas leading supplier of canned herring, today annou… [+1744 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "GlobeNewswire"
            },
            "author": "Levi & Korsinsky, LLP",
            "title": "October 15, 2024 Deadline: Contact Levi & Korsinsky to Join Class Action Suit Against SYM",
            "description": "NEW YORK, Sept. 05, 2024 (GLOBE NEWSWIRE) -- Levi & Korsinsky, LLP notifies investors in Symbotic Inc. (\"Symbotic\" or the \"Company\") (NASDAQ: SYM) of a class action securities lawsuit.",
            "url": "https://www.globenewswire.com/news-release/2024/09/05/2941729/3080/en/October-15-2024-Deadline-Contact-Levi-Korsinsky-to-Join-Class-Action-Suit-Against-SYM.html",
            "urlToImage": "https://ml.globenewswire.com/Resource/Download/d91bd4e6-7d18-43f7-a479-4f992242a82a",
            "publishedAt": "2024-09-05T18:14:00Z",
            "content": "NEW YORK, Sept. 05, 2024 (GLOBE NEWSWIRE) -- Levi &amp; Korsinsky, LLP notifies investors in Symbotic Inc. (\"Symbotic\" or the \"Company\") (NASDAQ: SYM) of a class action securities lawsuit.\r\nCLASS DEF… [+2179 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Yourmileagemayvary.com"
            },
            "author": "Your Mileage May Vary",
            "title": "He Upgraded To ANA Business Class & Left His Wife In Economy. And Then…",
            "description": "Sigh…I just love reading Reddit sometimes. It’s just a guilty pleasure for me. Established in 2005, Reddit is an American social news aggregator, web content rating, and discussion website. Registered…",
            "url": "https://yourmileagemayvary.com/2024/09/05/he-upgraded-to-ana-business-class-left-his-wife-in-economy-and-then/",
            "urlToImage": "https://yourmileagemayvary.com/wp-content/uploads/2022/02/Screen-Shot-2022-02-28-at-10.28.43-PM-e1646105371552.png",
            "publishedAt": "2024-09-05T18:13:52Z",
            "content": "3.1KSigh…I just love reading Reddit sometimes. It’s just a guilty pleasure for me.\r\nEstablished in 2005, Reddit is an American social news aggregator, web content rating, and discussion website. Regi… [+10041 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Slashdot.org"
            },
            "author": "feedfeeder",
            "title": "Harris agrees to muted mic rule in debate with Trump - BBC.com",
            "description": "Harris agrees to muted mic rule in debate with TrumpBBC.com Opinion | The presidential debate’s real mic problemThe Washington Post How to watch Trump, Harris debateThe Hill Harris campaign agrees to ABC presidential debate rules with some 'assurances:' repor…",
            "url": "https://slashdot.org/firehose.pl?op=view&amp;id=174928980",
            "urlToImage": null,
            "publishedAt": "2024-09-05T18:13:48Z",
            "content": "Check out the new Slashdot job board to browse remote jobs or jobs in your areaDo you develop on GitHub? You can keep using GitHub but automatically sync your GitHub releases to SourceForge quickly a… [+228 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Slashdot.org"
            },
            "author": "feedfeeder",
            "title": "Move over, Michael Douglas. Michael Keaton wants to start using his real name - Los Angeles Times",
            "description": "Move over, Michael Douglas. Michael Keaton wants to start using his real nameLos Angeles Times Michael Keaton Wants to Use a Version of His Real Name, Michael Douglas (Exclusive)PEOPLE Michael Keaton Is Ditching His Stage Name for His Real NameYahoo Entertain…",
            "url": "https://slashdot.org/firehose.pl?op=view&amp;id=174928978",
            "urlToImage": null,
            "publishedAt": "2024-09-05T18:13:37Z",
            "content": "Check out the new Slashdot job board to browse remote jobs or jobs in your areaDo you develop on GitHub? You can keep using GitHub but automatically sync your GitHub releases to SourceForge quickly a… [+228 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Biztoc.com"
            },
            "author": "semafor.com",
            "title": "US charges former Trump adviser amid Russian influence crackdown",
            "description": "The News\nThe US Department of Justice charged Dimitri Simes, a former adviser to Donald Trump’s 2016 presidential campaign, with working for a sanctioned Russian TV network and, alongside his wife, of laundering his illegal payments.\nFrom June 2022, the US al…",
            "url": "https://biztoc.com/x/92da71991525fe86",
            "urlToImage": "https://biztoc.com/cdn/92da71991525fe86_s.webp",
            "publishedAt": "2024-09-05T18:13:34Z",
            "content": "The NewsThe US Department of Justice charged Dimitri Simes, a former adviser to Donald Trumps 2016 presidential campaign, with working for a sanctioned Russian TV network and, alongside his wife, of … [+127 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Truthout"
            },
            "author": "Chris Walker",
            "title": "Kamala Harris, Donald Trump React to School Shooting in Georgia",
            "description": "Four people — two teachers and two students — were killed by a 14-year-old student of the school.",
            "url": "https://truthout.org/articles/kamala-harris-donald-trump-react-to-school-shooting-in-georgia/",
            "urlToImage": "https://truthout.org/app/uploads/2024/09/2024_0905-georgia-shooting-scaled.jpg",
            "publishedAt": "2024-09-05T18:13:33Z",
            "content": "Four people two teachers and two students were killed in a school shooting in Georgia on Wednesday, the latest mass shooting in an educational setting and the first major shooting in the U.S. this sc… [+4067 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "The Daily Caller"
            },
            "author": "Chad Ennis",
            "title": "CHAD ENNIS: The Left Is Freaking Out Over A Common Sense Voting Rule … Again",
            "description": "There is no election integrity measure that the Left will not sue to block. This seems like an outlandish sentence, but history keeps proving it true.",
            "url": "https://dailycaller.com/2024/09/05/opinion-the-left-is-freaking-out-over-a-common-sense-voting-rule-again-chad-ennis/",
            "urlToImage": "https://cdn01.dailycaller.com/wp-content/uploads/2024/09/GettyImages-1230129818-scaled-e1725559904955.jpg",
            "publishedAt": "2024-09-05T18:13:32Z",
            "content": "There is no election integrity measure that the Left will not sue to block. This seems like an outlandish sentence, but history keeps proving it true.\r\nThe Left’s election-industrial complex is ready… [+4922 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Hip-Hop Wired"
            },
            "author": "Christopher Smith",
            "title": "FBI Confirms Georgia High School Shooter Made Past Threats",
            "description": "The FBI confirmed to the press on Wednesday that it had previously investigated the 14-year-old suspect in the deadly shooting at Apalachee High School in Winder, Georgia last year. They noted several anonymous tips were sent detailing the threats.\nThe post F…",
            "url": "https://hiphopwired.com/2375690/fbi-confirms-georgia-high-school-shooter-made-past-threats/",
            "urlToImage": "https://hiphopwired.com/wp-content/uploads/sites/43/2024/09/17255598269608.jpg",
            "publishedAt": "2024-09-05T18:13:28Z",
            "content": "HipHopWired Featured Video\r\nSource: Jessica McGowan / Getty\r\nInvestigators at the Georgia high school where a shooting occurred confirmed that the suspect had been interviewed about past threats.\r\nOn… [+2045 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Slashdot.org"
            },
            "author": "feedfeeder",
            "title": "Climate crisis is helping spread deadly mosquito viruses in the US - Yahoo! Voices",
            "description": "Climate crisis is helping spread deadly mosquito viruses in the USYahoo! Voices Opinion | The Point: Conversations and insights about the moment.The New York Times America’s endless summers are good for mosquitoes, tooThe Economist Mosquito-Borne Illnesses on…",
            "url": "https://slashdot.org/firehose.pl?op=view&amp;id=174928972",
            "urlToImage": null,
            "publishedAt": "2024-09-05T18:13:26Z",
            "content": "Check out the new Slashdot job board to browse remote jobs or jobs in your areaDo you develop on GitHub? You can keep using GitHub but automatically sync your GitHub releases to SourceForge quickly a… [+228 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Slashdot.org"
            },
            "author": "feedfeeder",
            "title": "Why your next trip to the gyno might be different: There’s an alternative to Pap smears - CNN",
            "description": "Why your next trip to the gyno might be different: There&rsquo;s an alternative to Pap smearsCNN View Full Coverage on Google News ...",
            "url": "https://slashdot.org/firehose.pl?op=view&amp;id=174928970",
            "urlToImage": null,
            "publishedAt": "2024-09-05T18:13:16Z",
            "content": "Check out the new Slashdot job board to browse remote jobs or jobs in your areaDo you develop on GitHub? You can keep using GitHub but automatically sync your GitHub releases to SourceForge quickly a… [+228 chars]"
        },
        {
            "source": {
                "id": "usa-today",
                "name": "USA Today"
            },
            "author": "Fighting Irish Wire",
            "title": "Notre Dame head coach Marcus Freeman set the tone in practice this week",
            "description": "While Notre Dame football should by flying high after its season opening win over Texas A&M, there is still work to be done. The age old mantra of you practice how you play the game has been taken to heart by the Irish. During head coach Marcus F",
            "url": "https://fightingirishwire.usatoday.com/2024/09/05/notre-dame-football-marcus-freeman-northern-illinois-huskies-practice-report/",
            "urlToImage": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png",
            "publishedAt": "2024-09-05T18:13:03Z",
            "content": "Notre Dame Head Coach Marcus Freeman at Notre Dame spring football practice Thursday, March 7, 2024, at the Irish Athletics Center in South Bend.\r\nWhile Notre Dame football should by flying high afte… [+1108 chars]"
        },
        {
            "source": {
                "id": "techradar",
                "name": "TechRadar"
            },
            "author": "Craig Hale",
            "title": "Software group urges FTC to implement smart device software tethering guidance",
            "description": "In a letter to the FTC, a group of made up of 17 organizations and bodies is asking software tethering to be investigated.",
            "url": "https://www.techradar.com/pro/software-group-urges-ftc-to-implement-smart-device-software-tethering-guidance",
            "urlToImage": "https://cdn.mos.cms.futurecdn.net/JXNqTDCG3PobK6zsccCsq6-1200-80.jpg",
            "publishedAt": "2024-09-05T18:13:00Z",
            "content": "A letter signed by no fewer than 17 different groups is urging the Federal Trade Commission (FTC) to consider introducing clearer guidance for software tethering.\r\nDescribed as “making functions of a… [+2431 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Omaha World-Herald"
            },
            "author": "Dan Crisler",
            "title": "American Airlines to add Omaha-Philadelphia flights",
            "description": "American Airlines will add direct flights between Omaha’s Eppley Airfield and Philadelphia International Airport starting in June.",
            "url": "https://omaha.com/news/local/business/american-airlines-to-return-flights-between-philadelphia-and-eppley-airfield-next-year/article_dbbd00b8-6ba6-11ef-96ac-dbc50c7fc854.html",
            "urlToImage": "https://bloximages.newyork1.vip.townnews.com/omaha.com/content/tncms/assets/v3/editorial/d/bb/dbbd00b8-6ba6-11ef-96ac-dbc50c7fc854/66d9e22611f6f.preview.jpg?crop=1919%2C1007%2C0%2C36&resize=1200%2C630&order=crop%2Cresize",
            "publishedAt": "2024-09-05T18:12:36Z",
            "content": "American Airlines will add direct flights between Omahas Eppley Airfield and Philadelphia International Airport starting in June.\r\nIn a Facebook post, the Omaha Airport Authority announced the twice-… [+10500 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "CBS Sports"
            },
            "author": "Chuck Booth",
            "title": "USWNT's Alex Morgan announces retirement: Caitlin Clark, Mia Hamm and the best social media reactions",
            "description": "There was no shortage of messages sent Morgan's way after the news",
            "url": "https://www.cbssports.com/soccer/news/uswnts-alex-morgan-announces-retirement-caitlin-clark-mia-hamm-and-the-best-social-media-reactions/",
            "urlToImage": "https://sportshub.cbsistatic.com/i/r/2024/09/05/7ccf3704-126c-447b-b12a-c9e26010007c/thumbnail/1200x675/dea2e9c53df950c40d8fbdb648bc6776/alexmorgan.jpg",
            "publishedAt": "2024-09-05T18:12:26Z",
            "content": "On Thursday, United States women's national team forward Alex Morgan announced her retirement from soccer effective Sunday when the San Diego Wave host the North Carolina Courage on Paramount+ and CB… [+1928 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Slashdot.org"
            },
            "author": "feedfeeder",
            "title": "Fubo TV streaming plans are $30 off for the first month right now",
            "description": "More standard streaming services include live sports now — Sunday Night Football on Peacock, CBS NFL games on Paramount+, Thursday Night Football on Prime Video — but if you want a comprehensive suite of sports channels, plus other live programming and local …",
            "url": "https://slashdot.org/firehose.pl?op=view&amp;id=174928958",
            "urlToImage": null,
            "publishedAt": "2024-09-05T18:12:18Z",
            "content": "More standard streaming services include live sports now — Sunday Night Football on Peacock, CBS NFL games on Paramount+, Thursday Night Football on Prime Video — but if you want a comprehensive suit… [+1647 chars]"
        },
        {
            "source": {
                "id": "the-verge",
                "name": "The Verge"
            },
            "author": "Emma Roth",
            "title": "Google tests its ‘Ask Photos’ AI assistant that understands what’s in your pictures",
            "description": "Google is testing its new “Ask Photos” feature, which will answer questions about your photos and pull up relevant images.",
            "url": "https://www.theverge.com/2024/9/5/24236817/google-ask-photos-ai-assistant-test",
            "urlToImage": "https://cdn.vox-cdn.com/thumbor/3paMOCSkJrw9oAYvNX0YuWuP1Nk=/0x0:2040x1360/1200x628/filters:focal(1020x680:1021x681)/cdn.vox-cdn.com/uploads/chorus_asset/file/24016884/STK093_Google_05.jpg",
            "publishedAt": "2024-09-05T18:12:06Z",
            "content": "Google tests its Ask Photos AI assistant that understands whats in your pictures\r\nGoogle tests its Ask Photos AI assistant that understands whats in your pictures\r\n / Google Photos has also revamped … [+1998 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Den of Geek US"
            },
            "author": "Joe George",
            "title": "The Batman 2 Could Use Some Fantastical Villains",
            "description": "Sorry, fans of Golden Age Hawkman comics — the news is out. Director Matt Reeves has confirmed that the Gentleman Ghost will not appear in The Batman 2. “What was important to me was to find a way to take these pop icons, these mythical characters that everyb…",
            "url": "https://www.denofgeek.com/movies/the-batman-2-could-use-some-fantastical-villains/",
            "urlToImage": "https://www.denofgeek.com/wp-content/uploads/2022/03/The-Batman-Pattinson.jpeg",
            "publishedAt": "2024-09-05T18:11:49Z",
            "content": "But then again, that’s exactly the problem. Christopher Nolan already did grounded Batman, devoting plenty of screen time to explaining the reason for an indestructible Batmobile and Catwoman’s point… [+1694 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "NDTV News"
            },
            "author": null,
            "title": "Woman Paraded Half-Naked, Lover Stripped Over Affair In Bihar: Cops",
            "description": "In a shocking incident, a woman was beaten, tortured and paraded half-naked while her 'lover' was stripped by a group of people over their alleged affair in Bihar's Supaul district, police said on Thursday.",
            "url": "https://www.ndtv.com/india-news/woman-paraded-half-naked-lover-stripped-in-bihar-over-affair-cops-6500205",
            "urlToImage": "https://c.ndtvimg.com/2022-12/0htt5beg_india-police-generic_625x300_23_December_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=738",
            "publishedAt": "2024-09-05T18:11:20Z",
            "content": "A manhunt has been launched to catch the accused, says police (Representational)\r\nSupaul: In a shocking incident, a woman was beaten, tortured and paraded half-naked while her 'lover' was stripped by… [+1923 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "pymnts.com"
            },
            "author": "PYMNTS",
            "title": "Unlocking the 3 Biggest Benefits of Automating Accounts Payable",
            "description": "There’s a time and a place for doing things by hand. But as the first quarter of the 21st century comes to a close, that time and place shouldn’t be a firm’s back office. Yet from tedious invoice processing to fragmented financial tech stacks, the inefficienc…",
            "url": "https://www.pymnts.com/accounts-payable/2024/unlocking-the-3-biggest-benefits-of-automating-accounts-payable/",
            "urlToImage": "https://www.pymnts.com/wp-content/uploads/2022/06/ap-automation-fraud-prevention.jpg",
            "publishedAt": "2024-09-05T18:11:02Z",
            "content": "Theres a time and a place for doing things by hand. But as the first quarter of the 21st century comes to a close, that time and place shouldnt be a firms back office.\r\nYet from tedious invoice proce… [+6135 chars]"
        },
        {
            "source": {
                "id": "business-insider",
                "name": "Business Insider"
            },
            "author": "mfox@businessinsider.com (Matthew Fox)",
            "title": "Apple stock has 25% upside amid 4 potential catalysts from next week's iPhone 16 reveal, Goldman Sachs says",
            "description": "An unexpected price increase to the lineup of iPhone 16 models would provide Apple with a direct revenue boost, Goldman Sachs said.",
            "url": "https://markets.businessinsider.com/news/stocks/apple-stock-price-prediction-iphone-16-event-next-week-surprise-2024-9",
            "urlToImage": "https://i.insider.com/66d9c4931d8d2deb96b92d6b?width=1200&format=jpeg",
            "publishedAt": "2024-09-05T18:10:47Z",
            "content": "Apple's upcoming iPhone 16 event could boost the stock price if any \"upside surprises\" are announced, according to Goldman Sachs.\r\nIn a note this week, the bank said the four surprises could drive th… [+2089 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Footwear News"
            },
            "author": "Peter Verry",
            "title": "Patrick Mahomes’ NFL Offseason With Adidas: NIL Deals, Major Deal for Texas Tech and a New Adidas Shoe",
            "description": "The Adidas Mahomes 2 Impact FLX \"Race Against Time\" is available now via Adidas.com.",
            "url": "http://footwearnews.com/shoes/sneaker-news/patrick-mahomes-adidas-shoes-texas-tech-nil-deals-1203683305/",
            "urlToImage": "https://footwearnews.com/wp-content/uploads/2024/09/patrick-mahomes.jpg",
            "publishedAt": "2024-09-05T18:10:44Z",
            "content": "With some help from Adidas, NFL star Patrick Mahomes has had a busy offseason.\r\nIn the months since leading the Kansas City Chiefs to another Super Bowl win in February, Adidas — the brand that has b… [+3188 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Business Standard"
            },
            "author": "Reuters",
            "title": "Verizon to buy Frontier in $20 bln deal to boost US fiber network",
            "description": "Verizon has offered $38.50 per share, representing a premium of 37.3% to the closing stock price of Frontier on Sept. 3, a day before reports of a potential acquisition first emerged",
            "url": "https://www.business-standard.com/world-news/verizon-to-buy-frontier-in-20-bln-deal-to-boost-us-fiber-network-124090501577_1.html",
            "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2024-09/05/thumb/fitandfill/400X400/1725559660-4545.jpg",
            "publishedAt": "2024-09-05T18:10:41Z",
            "content": "Verizon has offered $38.50 per share, representing a premium of 37.3% to the closing stock price of Frontier on Sept. 3, a day before reports of a potential acquisition first emerged\r\nVerizon | Image… [+2746 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "International Business Times"
            },
            "author": "Mark Moore",
            "title": "Harris Raises $300 Million in August, Doubling Trump's Take: Report",
            "description": "August was a momentous month for Harris: she accepted the Democratic nomination and named Walz as her running mate",
            "url": "https://www.ibtimes.com/kamala-harris-fundraising-donald-trump-3742079",
            "urlToImage": "https://d.ibtimes.com/en/full/4545818/harris-fundraising.jpg",
            "publishedAt": "2024-09-05T18:10:24Z",
            "content": "Vice President Kamala Harris' political operation hauled in more than $300 million in August - more than double the amount Donald Trump's campaign raised, according to a report.\r\nTwo sources familiar… [+897 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Bleeding Cool News"
            },
            "author": "Ray Flook",
            "title": "Uzumaki Trailer Is As Disturbingly Twisted as We Hoped It Would Be",
            "description": "It's been a long time coming – and it's looking like it was more than worth the wait. On Saturday, September 28th at 12:30 am, Adult Swim's anime adaptation of Junji Ito's Japanese horror manga Uzumaki will make its debut – and now, we have an official traile…",
            "url": "https://bleedingcool.com/tv/uzumaki-trailer-is-as-disturbingly-twisted-as-we-hoped-it-would-be/",
            "urlToImage": "https://bleedingcool.com/wp-content/uploads/2024/07/UZUMAKI_ep01_c121-2000x1125.jpg",
            "publishedAt": "2024-09-05T18:10:19Z",
            "content": "Posted in: Adult Swim, TV | Tagged: Adult Swim, uzumaki\r\nDebuting on Saturday, September 28th, here's the official trailer for Adult Swim's adaptation of Junji Ito's Japanese horror manga Uzumaki.\r\nI… [+2369 chars]"
        },
        {
            "source": {
                "id": "buzzfeed",
                "name": "Buzzfeed"
            },
            "author": "Matt Stopera",
            "title": "Tim Walz's Republican Brother Just Opened Up About Their Childhood Together, And Yeah, It Checks Out",
            "description": "Sounds exactly like something Tim Walz would do.View Entire Post ›",
            "url": "https://www.buzzfeed.com/mjs538/tim-walz-brother-story",
            "urlToImage": "https://img.buzzfeed.com/buzzfeed-static/static/2024-09/5/17/campaign_images/ce0bbe8f288b/tim-walzs-republican-brother-has-the-most-tim-wal-3-1920-1725557056-0_dblbig.jpg",
            "publishedAt": "2024-09-05T18:10:13Z",
            "content": "Make your vote count! Learn more about how to register, important deadlines, and your state's mail-in voting options here. For more on the 2024 election, check out coverage on BuzzFeed, HuffPost, and… [+9 chars]"
        },
        {
            "source": {
                "id": "cbc-news",
                "name": "CBC News"
            },
            "author": null,
            "title": "Workers needed to 'drill, baby, drill' — for clean energy",
            "description": "In this week's issue of our environmental newsletter, we look at green job opportunities in energy, check out a strange-looking transatlantic freighter and learn why an Ontario city is considering making transit free for everyone.",
            "url": "https://www.cbc.ca/news/science/what-on-earth-drillers-energy-1.7314001",
            "urlToImage": "https://i.cbc.ca/1.7314018.1725542084!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/jacob-arseneau.JPG",
            "publishedAt": "2024-09-05T18:10:09Z",
            "content": "Our planet is changing. So is our journalism. Keep up with the latest news on our Climate and Environment page.\r\nSign up here to get this newsletter in your inbox every Thursday. \r\nThis week:\r\n<ul><l… [+10621 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Tom's Hardware UK"
            },
            "author": "Anton Shilov",
            "title": "AMD's Ryzen 5 7600X3D is no longer exclusive to the U.S. — the latest 3D V-Cache chip is now available in Germany for €329",
            "description": "AMD's Ryzen 5 7600X3D is no longer exclusive to Micro Center in the U.S. as it becomes available in Germany.",
            "url": "https://www.tomshardware.com/pc-components/cpus/amds-ryzen-5-7600x3d-is-no-longer-exclusive-to-the-us-the-latest-3d-v-cache-chip-is-now-available-in-germany-for-euro329",
            "urlToImage": "https://cdn.mos.cms.futurecdn.net/Y5UTb4tEgFHCngXsXmCq8V-1200-80.png",
            "publishedAt": "2024-09-05T18:09:51Z",
            "content": "AMD's Ryzen 5 7600X3D processor for mid-range gaming PCs will not be exclusive to the U.S. and Micro Center. As Andreas Schilling noticed, the CPU is now available in Germany as well. But just like i… [+2063 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Stereogum"
            },
            "author": "Abby Jones",
            "title": "Machine Girl – “Motherfather”",
            "description": "Last month, Machine Girl announced that their first album in five years, MG Ultra, will arrive in October. With the news, they dropped lead single “Until I Die.” Today, they’re back with “Motherfather.”",
            "url": "https://www.stereogum.com/2278971/machine-girl-motherfather/music/",
            "urlToImage": "https://static.stereogum.com/uploads/2024/09/MACHINE_GIRL_SHOOT_JUNE_240486_HIRES_MOTHERFATHER_PR-1725558039.jpg",
            "publishedAt": "2024-09-05T18:09:28Z",
            "content": "Last month, Machine Girl announced that their first album in five years, MG Ultra, will arrive in October. With the news, they dropped lead single “Until I Die.” Today, they’re back with “Motherfathe… [+867 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Tom's Hardware UK"
            },
            "author": "Anton Shilov",
            "title": "Intel Xeon W-3595X 60-core CPU overclocked to 5.80 GHz — 1 GHz over the default 4.8 GHz boost clock",
            "description": "Intel's Xeon W-3595X, 'Sapphire Rapids Refresh,' seems to have a better overclocking potential than the predecessor, but at what power?",
            "url": "https://www.tomshardware.com/pc-components/cpus/intel-xeon-w-3595x-60-core-cpu-overclocked-to-580-ghz-1-ghz-over-the-default-48-ghz-boost-clock",
            "urlToImage": "https://cdn.mos.cms.futurecdn.net/q4Kr6c6tj2VMJ2Mu5sByqd-1200-80.jpg",
            "publishedAt": "2024-09-05T18:09:13Z",
            "content": "Ever since AMD and Intel repositioned their Ryzen Threadripper and Xeon W (well, Core Extreme) processors from high-end desktops to workstations, their overclocking capability was largely forgotten, … [+2448 chars]"
        },
        {
            "source": {
                "id": "cbs-news",
                "name": "CBS News"
            },
            "author": "Stephen Swanson, WCCO Staff",
            "title": "House committee subpoenas Tim Walz in $250M COVID fraud probe",
            "description": "Tim Walz, Minnesota's governor and the Democratic nominee for vice president, may have to stand before a U.S. House of Representatives committee to answer questions about the Feeding Our Future fraud scandal.",
            "url": "https://www.cbsnews.com/minnesota/news/tim-walz-us-house-committee-subpoena-feeding-our-future/",
            "urlToImage": "https://assets3.cbsnewsstatic.com/hub/i/r/2024/09/05/06b633a2-d548-4208-8c58-a9f0999f526e/thumbnail/1200x630/18e74c5e81fff2c79d030691e4a67146/ap24241592927846.jpg?v=631cf5f2b4e8db7f9bc428589402864d",
            "publishedAt": "2024-09-05T18:09:00Z",
            "content": "Gov. Tim Walz issued subpoena for Feeding Our Future fraud scheme \r\nGov. Tim Walz issued subpoena for Feeding Our Future fraud scheme00:35\r\nMINNEAPOLIS — Tim Walz, Minnesota's governor and the Democr… [+4203 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Daily Signal"
            },
            "author": "John Stossel",
            "title": "A Dam Good Argument",
            "description": "Instead of using fossil fuels, we’re told to use “clean” energy: wind, solar, or hydropower. Hydro is the most reliable. Unlike wind and sunlight, it... Read More\nThe post A Dam Good Argument appeared first on The Daily Signal.",
            "url": "https://www.dailysignal.com/2024/09/05/a-dam-good-argument/",
            "urlToImage": "https://www.dailysignal.com/wp-content/uploads/2024/09/GettyImages-1355167996.jpg",
            "publishedAt": "2024-09-05T18:08:33Z",
            "content": "Instead of using fossil fuels, we’re told to use “clean” energy: wind, solar, or hydropower.\r\nHydro is the most reliable. Unlike wind and sunlight, it flows steadily.\r\nBut now, environmental groups w… [+4122 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "The Daily Caller"
            },
            "author": "Harold Hutchison",
            "title": "‘Legal Death Wish’: Jonathan Turley Says Hunter Biden Likely Headed To Jail",
            "description": "George Washington University law professor Jonathan Turley said that despite a sudden guilty plea, Hunter Biden would likely face prison time on tax charges.",
            "url": "https://dailycaller.com/2024/09/05/jonathan-turley-hunter-biden-headed-to-jail/",
            "urlToImage": "https://cdn01.dailycaller.com/wp-content/uploads/2024/09/DCNF-Turley-Biden-Plea-Change-Featured.jpg",
            "publishedAt": "2024-09-05T18:08:32Z",
            "content": "Readers,\r\nInstead of sucking up to the political and corporate powers that dominate America, The Daily Caller is fighting for you our readers. We humbly ask you to consider joining us in this fight.\r… [+3541 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Phys.Org"
            },
            "author": "Science X",
            "title": "How fish guts might play a role in future skin care products",
            "description": "There are some pretty strange ingredients in cosmetics and skin care products. One example is snail mucin—also known as snail slime—which is used for its moisturizing and antioxidant properties. But researchers reporting in ACS Omega might have found somethin…",
            "url": "https://phys.org/news/2024-09-fish-guts-play-role-future.html",
            "urlToImage": "https://scx2.b-cdn.net/gfx/news/2024/how-fish-guts-might-pl.jpg",
            "publishedAt": "2024-09-05T18:08:16Z",
            "content": "There are some pretty strange ingredients in cosmetics and skin care products. One example is snail mucinalso known as snail slimewhich is used for its moisturizing and antioxidant properties. But re… [+2434 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Digital Trends"
            },
            "author": "Carli Velocci",
            "title": "Black Myth: Wukong set to get a DLC expansion before a sequel",
            "description": "According to a report, the Black Myth: Wukong developers are working on a DLC expansion so players don't have to wait years for more.",
            "url": "https://www.digitaltrends.com/gaming/black-myth-wukong-dlc-expansion-reports/",
            "urlToImage": "https://www.digitaltrends.com/wp-content/uploads/2024/08/black-myth-wukong-fight.jpg?resize=1200%2C630&p=1",
            "publishedAt": "2024-09-05T18:08:00Z",
            "content": "Game Science\r\nBlack Myth: Wukong is only just getting started, with a reported expansion on the way in lieu of a sequel.\r\nAccording to a Bloomberg interview with Daniel Wu, the head of Game Science i… [+2421 chars]"
        }
    ]
}