{
    "status": "ok",
    "totalResults": 13,
    "articles": [
        {
            "source": {
                "id": "the-washington-post",
                "name": "The Washington Post"
            },
            "author": "Andrew Ackerman",
            "title": "Fed governor to resign early, handing Trump immediate opening on board - The Washington Post",
            "description": "Federal Reserve governor Adriana Kugler is stepping down from her position early, creating an unexpected opening for President Donald Trump to shape the central bank.",
            "url": "https://www.washingtonpost.com/business/2025/08/01/kugler-resigns-fed-trump/",
            "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/OTKBAAJ7FRLYVXE6UGUKIPBV5M_size-normalized.JPG&w=1440",
            "publishedAt": "2025-08-02T00:02:01Z",
            "content": "Federal Reserve governor Adriana Kugler is stepping down early from the central banks powerful board of governors, creating an immediate vacancy that will give President Donald Trump an early opportu… [+5447 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Investor's Business Daily"
            },
            "author": "RYAN DEFFENBAUGH, Investor's Business Daily",
            "title": "Is Amazon Losing Ground To Microsoft And Google in AI? - Investor's Business Daily",
            "description": "Amazon stock tumbled Friday as investors digested cloud revenue growth that disappointed compared to results from Google and Microsoft.",
            "url": "https://www.investors.com/news/technology/amazon-stock-ai-cloud-microsoft-google/",
            "urlToImage": "https://www.investors.com/wp-content/uploads/2016/08/stock-amazon-3-iStock.jpg",
            "publishedAt": "2025-08-01T20:45:00Z",
            "content": "Amazon's second-quarter cloud revenue growth was good, but it wasn't Microsoft or Google Cloud good. And that put the tech giant on the defensive about its position in generative AI. Amazon (AMZN) st… [+5331 chars]"
        },
        {
            "source": {
                "id": "wired",
                "name": "Wired"
            },
            "author": "Aarian Marshall",
            "title": "Tesla Found Partly Liable in 2019 Autopilot Death - WIRED",
            "description": "A Miami jury has ordered the automaker to pay up to $243 million after finding that the Tesla vehicle had a “defect.” It's the first time Tesla has been found liable in an Autopilot-related crash.",
            "url": "https://www.wired.com/story/tesla-liable-2019-autopilot-crash-death/",
            "urlToImage": "https://media.wired.com/photos/688d10ef5587c22a6048a226/191:100/w_1280,c_limit/tesla-crash-biz-2207557822.jpg",
            "publishedAt": "2025-08-01T20:41:28Z",
            "content": "A Miami jury found Tesla partially liable Friday in a 2019 crash that killed one person and injured anotherall while the driver of the Model S used the automakers Autopilot driver assistance feature.… [+3541 chars]"
        },
        {
            "source": {
                "id": "the-wall-street-journal",
                "name": "The Wall Street Journal"
            },
            "author": "Roshan Fernandez, Heather Haddon, Matt Grossman, Krystal Hur, Inti Pacheco, Paul Kiernan, Alex Leary, Vipal Monga, Ryan Dezember, Sam Goldfarb, WSJ Staff, Liz Young, Caitlin McCabe",
            "title": "Stock Market Today: Dow Closes 500 Points Lower on Weak Jobs Report, New Trump Tariffs — Live Updates - The Wall Street Journal",
            "description": "The July jobs report showed hiring slowed last month and unemployment ticked up to 4.2%. Trump’s tariffs and trade deals continue to affect global markets. Follow along for live updates on the Dow, S&P 500 and Nasdaq.",
            "url": "https://www.wsj.com/livecoverage/jobs-report-today-stock-market-08-01-2025",
            "urlToImage": "https://images.wsj.net/im-34062673/social",
            "publishedAt": "2025-08-01T20:18:00Z",
            "content": "President Trump said he directed his team to fire the top Bureau of Labor Statistics official after the bureau issued a weak jobs report on Friday.\r\nThe report weighed on markets Friday along with Tr… [+2524 chars]"
        },
        {
            "source": {
                "id": "fortune",
                "name": "Fortune"
            },
            "author": "Jason Ma",
            "title": "Shockingly bad jobs report reveals a months-long stall and may trigger Fed rate cuts soon. 'Powell is going to regret holding rates steady' - Fortune",
            "description": "“September is a lock for a rate cut, and it might even be a 50-basis-point move to make up the lost time.”",
            "url": "https://fortune.com/2025/08/01/jobs-report-july-downward-revisions-fed-rate-cuts-jerome-powell/",
            "urlToImage": "https://fortune.com/img-assets/wp-content/uploads/2025/08/GettyImages-961144554-e1754054715520.jpg?resize=1200,600",
            "publishedAt": "2025-08-01T20:08:00Z",
            "content": "The U.S. labor market looks much weaker than previously thought, and Wall Street now expects the Federal Reserve to resume rate cuts sooner rather than later.The Labor Department reported Friday that… [+5189 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "BBC News"
            },
            "author": null,
            "title": "Car finance: Millions denied payouts after Supreme Court ruling - BBC",
            "description": "The Supreme Court partially upholds an appeal from lenders, who had faced potentially paying compensation to millions of motorists.",
            "url": "https://www.bbc.com/news/articles/cj9w0dj0yjyo",
            "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/9c7f/live/c6d5a7c0-6ecc-11f0-af20-030418be2ca5.jpg",
            "publishedAt": "2025-08-01T17:40:51Z",
            "content": "Rachel ClunBusiness reporter, BBC News\r\nMillions of motorists will not be able to claim compensation for hidden commissions paid on car loans following a Supreme Court ruling.\r\nThe UK's highest court… [+4470 chars]"
        },
        {
            "source": {
                "id": "axios",
                "name": "Axios"
            },
            "author": "Neil Irwin",
            "title": "Alarming jobs report makes potent case for the Fed to cut interest rates - Axios",
            "description": "The odds of a rate cut at the next Fed policy meeting in mid-September skyrocketed after the weak numbers.",
            "url": "https://www.axios.com/2025/08/01/jobs-report-july-fed-rate-cuts",
            "urlToImage": "https://images.axios.com/FQvRMvEwC2608RynMUT6O7rjH6w=/0x0:1920x1080/1366x768/2025/08/01/1754066414705.jpg",
            "publishedAt": "2025-08-01T17:02:02Z",
            "content": "What they're saying: Waller's statement says that \"while the labor market looks fine on the surface, once we account for expected data revisions, private-sector payroll growth is near stall speed, an… [+939 chars]"
        },
        {
            "source": {
                "id": "associated-press",
                "name": "Associated Press"
            },
            "author": null,
            "title": "What consumers can expect from import taxes as the US sets new tariff rates - AP News",
            "description": "American businesses and consumers are finding the contours of President Donald Trump’s foreign trade agenda taking shape. But they don't have much more clarity on how import taxes on goods from dozens of countries will affect them. Late Thursday, Trump ordere…",
            "url": "https://apnews.com/article/trump-tariffs-consumers-prices-ebf959d8f8ad24bd0757d8e3693924c1",
            "urlToImage": "https://dims.apnews.com/dims4/default/bed8879/2147483647/strip/true/crop/3000x1688+0+159/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe7%2Fff%2F89676f2f6a4c21237df3f1c58600%2Fc351168a2edc485ca1e7fc818f86c6d2",
            "publishedAt": "2025-08-01T15:31:00Z",
            "content": "Its been almost 100 years since the U.S. had tariffs at the level they could reach next Friday.\r\nOnce President Donald Trumps planned tariffs take effect, Americans will see an average tax of 18.3% f… [+7662 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Tipranks.com"
            },
            "author": "David Craik",
            "title": "Don’t Expect Apple Stock (AAPL) to Pop Until AI and Tariff Uncertainty Ease, Say Analysts - TipRanks",
            "description": "Apple ($AAPL) stock was higher today after analysts largely gave a thumbs up to its strong Q3 results, but investors shouldn’t expect a huge uptick until AI and tar...",
            "url": "https://www.tipranks.com/news/dont-expect-apple-stock-aapl-to-pop-until-ai-and-tariff-uncertainty-ease-say-analysts",
            "urlToImage": "https://blog.tipranks.com/wp-content/uploads/2025/08/applesiri-750x406.jpg",
            "publishedAt": "2025-08-01T13:41:15Z",
            "content": "Story HighlightsAAPL stock is higher but tariffs and AI concerns continue to weigh."
        },
        {
            "source": {
                "id": "bloomberg",
                "name": "Bloomberg"
            },
            "author": "Hadriana Lowenkron, Magan Crane",
            "title": "Trump Urges Fed Board to ‘Assume Control’ If Rates Are Not Cut - Bloomberg.com",
            "description": "President Donald Trump said Federal Reserve Chair Jerome Powell should be put “out to pasture” and called on the central bank’s board to “assume control” if interest rates were not lowered, escalating an ongoing feud.",
            "url": "https://www.bloomberg.com/news/articles/2025-08-01/trump-urges-fed-board-to-assume-control-if-rates-are-not-cut",
            "urlToImage": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iBnQLE1j9bCE/v0/1200x800.jpg",
            "publishedAt": "2025-08-01T12:31:25Z",
            "content": "President Donald Trump said Federal Reserve Chair Jerome Powell should be put out to pasture and called on the central banks board to assume control if interest rates were not lowered, escalating an … [+242 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "CNBC"
            },
            "author": "Annika Kim Constantino",
            "title": "Moderna cuts high end of 2025 revenue outlook on vaccine shipment delay in U.K. - CNBC",
            "description": "Moderna also lost less than Wall Street analysts were expecting for the second quarter and posted revenue that topped estimates.",
            "url": "https://www.cnbc.com/2025/08/01/moderna-mrna-q2-2025-earnings.html",
            "urlToImage": "https://image.cnbcfm.com/api/v1/image/108179665-1753963607762-gettyimages-2208760970-porzycki-modernai250409_npAz5.jpeg?v=1754054307&w=1920&h=1080",
            "publishedAt": "2025-08-01T11:03:44Z",
            "content": "Moderna on Friday lowered the high end of its 2025 revenue outlook due to a delay in vaccine shipments to the U.K., but beat Wall Street's expectations for the second quarter as it works to cut costs… [+2455 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "CNBC"
            },
            "author": "Brian Evans, Sawdah Bhaimiya",
            "title": "Treasury yields tumble after much weaker-than-expected July jobs report - CNBC",
            "description": "U.S. Treasury yields slid on Friday as investors reacted to deterioration in the labor market and gauged the effect of high tariffs on the economy.",
            "url": "https://www.cnbc.com/2025/08/01/us-treasury-yields-investors-await-key-jobs-report-.html",
            "urlToImage": "https://image.cnbcfm.com/api/v1/image/108162533-1750785335791-108162533-1750691270564-NYSE_Traders-OB-Photo-20250623-CC-PRESS-3.jpg?v=1750785382&w=1920&h=1080",
            "publishedAt": "2025-08-01T09:56:46Z",
            "content": "U.S. Treasury yields tumbled Friday after investors considered a far weaker-than-expected July nonfarm payroll report and weighed the effect of President Donald Trump's raft of new tariffs on economi… [+2041 chars]"
        }
    ]
}